/* automatically generated by rust-bindgen 0.66.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const RPU_ADDR_SPI_START: u32 = 0x0;
pub const RPU_ADDR_GRAM_START: u32 = 0xb7000000;
pub const RPU_ADDR_GRAM_END: u32 = 0xb70101ff;
pub const RPU_ADDR_SBUS_START: u32 = 0xa4000000;
pub const RPU_ADDR_SBUS_END: u32 = 0xa4007fff;
pub const RPU_ADDR_PBUS_START: u32 = 0xa5000000;
pub const RPU_ADDR_PBUS_END: u32 = 0xa503ffff;
pub const RPU_ADDR_BEV_START: u32 = 0xbfc00000;
pub const RPU_ADDR_BEV_END: u32 = 0xbfcfffff;
pub const RPU_ADDR_PKTRAM_START: u32 = 0xb0000000;

pub const NRF_WIFI_EVENT_GET_WIPHY_VALID_RADAR_DETECT_WIDTHS: u32 = 0x1;
pub const NRF_WIFI_EVENT_GET_WIPHY_VALID_RADAR_DETECT_REGIONS: u32 = 0x2;
pub const NRF_WIFI_EVENT_GET_WIPHY_VALID_: u32 = 0x4;
pub const NRF_WIFI_EVENT_GET_WIPHY_MAX_CIPHER_COUNT: u32 = 0x1e;
pub const NRF_WIFI_EVENT_GET_WIPHY_IBSS_RSN: u32 = 0x1;
pub const NRF_WIFI_EVENT_GET_WIPHY_MESH_AUTH: u32 = 0x2;
pub const NRF_WIFI_EVENT_GET_WIPHY_AP_UAPSD: u32 = 0x4;
pub const NRF_WIFI_EVENT_GET_WIPHY_SUPPORTS_FW_ROAM: u32 = 0x8;
pub const NRF_WIFI_EVENT_GET_WIPHY_SUPPORTS_TDLS: u32 = 0x10;
pub const NRF_WIFI_EVENT_GET_WIPHY_TDLS_EXTERNAL_SETUP: u32 = 0x20;
pub const NRF_WIFI_EVENT_GET_WIPHY_CONTROL_PORT_ETHERTYPE: u32 = 0x40;
pub const NRF_WIFI_EVENT_GET_WIPHY_OFFCHANNEL_TX_OK: u32 = 0x80;
pub const NRF_WIFI_GET_WIPHY_VALID_PROBE_RESP_OFFLOAD: u32 = 0x1;
pub const NRF_WIFI_GET_WIPHY_VALID_TX_ANT: u32 = 0x2;
pub const NRF_WIFI_GET_WIPHY_VALID_RX_ANT: u32 = 0x4;
pub const NRF_WIFI_GET_WIPHY_VALID_MAX_NUM_SCAN_SSIDS: u32 = 0x8;
pub const NRF_WIFI_GET_WIPHY_VALID_NUM_SCHED_SCAN_SSIDS: u32 = 0x10;
pub const NRF_WIFI_GET_WIPHY_VALID_MAX_MATCH_SETS: u32 = 0x20;
pub const NRF_WIFI_GET_WIPHY_VALID_MAC_ACL_MAX: u32 = 0x40;
pub const NRF_WIFI_GET_WIPHY_VALID_HAVE_AP_SME: u32 = 0x80;
pub const NRF_WIFI_GET_WIPHY_VALID_EXTENDED_CAPABILITIES: u32 = 0x100;
pub const NRF_WIFI_GET_WIPHY_VALID_MAX_AP_ASSOC_STA: u32 = 0x200;
pub const NRF_WIFI_GET_WIPHY_VALID_WIPHY_NAME: u32 = 0x400;
pub const NRF_WIFI_GET_WIPHY_VALID_EXTENDED_FEATURES: u32 = 0x800;
pub const EXTENDED_FEATURE_LEN: u32 = 0x3c;
pub const NRF_WIFI_INDEX_IDS_WIPHY_NAME: u32 = 0x20;
pub const NRF_WIFI_EVENT_GET_WIPHY_NUM_BANDS: u32 = 0x2;
pub const REG_RULE_FLAGS_VALID: u32 = 0x1;
pub const FREQ_RANGE_START_VALID: u32 = 0x2;
pub const FREQ_RANGE_END_VALID: u32 = 0x4;
pub const FREQ_RANGE_MAX_BW_VALID: u32 = 0x8;
pub const POWER_RULE_MAX_EIRP_VALID: u32 = 0x10;
pub const NRF_WIFI_CMD_SET_REG_ALPHA2_VALID: u32 = 0x1;
pub const NRF_WIFI_CMD_SET_REG_RULES_VALID: u32 = 0x2;
pub const NRF_WIFI_CMD_SET_REG_DFS_REGION_VALID: u32 = 0x4;
pub const MAX_NUM_REG_RULES: u32 = 0x20;
pub const NRF_WIFI_CMD_REQ_SET_REG_ALPHA2_VALID: u32 = 0x1;
pub const NRF_WIFI_CMD_REQ_SET_REG_USER_REG_HINT_TYPE_VALID: u32 = 0x2;
pub const NRF_WIFI_CMD_REQ_SET_REG_USER_REG_FORCE: u32 = 0x4;
pub const NRF_WIFI_EVNT_WIPHY_SELF_MANAGED: u32 = 0x1;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum RPU_MCU_ADDR_REGIONS {
    RPU_MCU_ADDR_REGION_ROM = 0,
    RPU_MCU_ADDR_REGION_RETENTION = 1,
    RPU_MCU_ADDR_REGION_SCRATCH = 2,
    RPU_MCU_ADDR_REGION_MAX = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_addr_region {
    pub start: ::core::ffi::c_uint,
    pub end: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_addr_region() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_addr_region> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_addr_region>(),
        8usize,
        concat!("Size of: ", stringify!(rpu_addr_region))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_addr_region>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_addr_region))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_addr_region),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rpu_addr_region), "::", stringify!(end))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_addr_map {
    pub regions: [rpu_addr_region; 3usize],
}
#[test]
fn bindgen_test_layout_rpu_addr_map() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_addr_map> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_addr_map>(),
        24usize,
        concat!("Size of: ", stringify!(rpu_addr_map))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_addr_map>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_addr_map))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).regions) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rpu_addr_map), "::", stringify!(regions))
    );
}
extern "C" {
    pub static RPU_ADDR_MAP_MCU: [rpu_addr_map; 2usize];
}
#[doc = " struct nrf_wifi_rpu_pwr_data - Data that host may want to read from the Power IP.\n @lfc_err: Estimated Lo Frequency Clock error in ppm.\n @vbat_mon: Vbat monitor readout. The actual Vbat in volt equals 2.5 + 0.07*vbat_mon.\n @temp: Estimated die temperature (degC).\n\n This structure represents the Power IP monitoring data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_rpu_pwr_data {
    pub lfc_err: ::core::ffi::c_int,
    pub vbat_mon: ::core::ffi::c_int,
    pub temp: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_rpu_pwr_data() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_rpu_pwr_data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_rpu_pwr_data>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_rpu_pwr_data))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_rpu_pwr_data>(),
        4usize,
        concat!("Alignment of ", stringify!(nrf_wifi_rpu_pwr_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lfc_err) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(lfc_err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_mon) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(vbat_mon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rpu_pwr_data),
            "::",
            stringify!(temp)
        )
    );
}
#[doc = " struct host_rpu_rx_buf_info - RX buffer related information to be passed to\n                               the RPU.\n @addr: Address in the host memory where the RX buffer is located.\n\n This structure encapsulates the information to be passed to the RPU for\n buffers which the RPU will use to pass the received frames."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_rx_buf_info {
    pub addr: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_rx_buf_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_rx_buf_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_rx_buf_info>(),
        4usize,
        concat!("Size of: ", stringify!(host_rpu_rx_buf_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_rx_buf_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_rx_buf_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_rx_buf_info),
            "::",
            stringify!(addr)
        )
    );
}
#[doc = " struct host_rpu_hpq - Hostport Queue (HPQ) information.\n @enqueue_addr: HPQ address where the host can post the address of a\n                message intended for the RPU.\n @dequeue_addr: HPQ address where the host can get the address of a\n                message intended for the host.\n\n This structure encapsulates the information which represents a HPQ."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_hpq {
    pub enqueue_addr: ::core::ffi::c_uint,
    pub dequeue_addr: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_hpq() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_hpq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_hpq>(),
        8usize,
        concat!("Size of: ", stringify!(host_rpu_hpq))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_hpq>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_hpq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enqueue_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpq),
            "::",
            stringify!(enqueue_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dequeue_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpq),
            "::",
            stringify!(dequeue_addr)
        )
    );
}
#[doc = " struct host_rpu_hpqm_info - Information about Hostport Queues (HPQ) to be used\n            for exchanging information between the Host and RPU.\n @event_busy_queue: Queue which the RPU uses to inform the host about events.\n @event_avl_queue: Queue on which the consumed events are pushed so that RPU\n                    can reuse them.\n @cmd_busy_queue: Queue used by the host to push commands to the RPU.\n @cmd_avl_queue: Queue which RPU uses to inform host about command\n                  buffers which can be used to push commands to the RPU.\n\n Hostport queue information passed by the RPU to the host, which the host can\n use, to communicate with the RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_hpqm_info {
    pub event_busy_queue: host_rpu_hpq,
    pub event_avl_queue: host_rpu_hpq,
    pub cmd_busy_queue: host_rpu_hpq,
    pub cmd_avl_queue: host_rpu_hpq,
    pub rx_buf_busy_queue: [host_rpu_hpq; 3usize],
}
#[test]
fn bindgen_test_layout_host_rpu_hpqm_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_hpqm_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_hpqm_info>(),
        56usize,
        concat!("Size of: ", stringify!(host_rpu_hpqm_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_hpqm_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_hpqm_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_busy_queue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(event_busy_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_avl_queue) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(event_avl_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_busy_queue) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(cmd_busy_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_avl_queue) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(cmd_avl_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buf_busy_queue) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_hpqm_info),
            "::",
            stringify!(rx_buf_busy_queue)
        )
    );
}
#[doc = " struct host_rpu_msg_hdr - Common header included in each command/event.\n @len: Length of the message.\n @resubmit: Flag to indicate whether the recipient is expected to resubmit\n            the cmd/event address back to the trasmitting entity.\n\n This structure encapsulates the common information included at the start of\n each command/event exchanged with the RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_msg_hdr {
    pub len: ::core::ffi::c_uint,
    pub resubmit: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_host_rpu_msg_hdr() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_msg_hdr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_msg_hdr>(),
        8usize,
        concat!("Size of: ", stringify!(host_rpu_msg_hdr))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_msg_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_msg_hdr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(host_rpu_msg_hdr), "::", stringify!(len))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).resubmit) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_msg_hdr),
            "::",
            stringify!(resubmit)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pta_ext_params {
    #[doc = " Set polarity to 1 if  BT_TX_RX active high indicates Tx. Set polarity to 0 if BT_TX_RX\n active high indicates Rx."]
    pub tx_rx_pol: ::core::ffi::c_uchar,
    #[doc = " BT_ACTIVE signal lead time period. This is with reference to time instance at which\nBT slot boundary starts if BT supports classic only mode and BT activity starts if BT\nsupports BLE or dual mode"]
    pub lead_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which BT_STATUS is sampled by PTA to get the BT_PTI information. This\nis done anywhere between BT_ACTIVE_ASSERT time and BT_STATUS priority signalling time\nperiod ends.This is with reference to BT_ACTIVE assert time."]
    pub pti_samp_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which BT_STATUS is sampled by PTA to get BT_TX_RX information.\nThis is done by PTA after the end of time period T2.  This is with reference to BT_ACTIVE\nassert time."]
    pub tx_rx_samp_time: ::core::ffi::c_uint,
    #[doc = " Time instance at which PTA takes arbitration decision and posts WLAN_DENY to BT. This\n is with reference to BT_ACTIVE assert time."]
    pub dec_time: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_pta_ext_params() {
    const UNINIT: ::core::mem::MaybeUninit<pta_ext_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pta_ext_params>(),
        17usize,
        concat!("Size of: ", stringify!(pta_ext_params))
    );
    assert_eq!(
        ::core::mem::align_of::<pta_ext_params>(),
        1usize,
        concat!("Alignment of ", stringify!(pta_ext_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_rx_pol) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(tx_rx_pol)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lead_time) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(lead_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pti_samp_time) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(pti_samp_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_rx_samp_time) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(tx_rx_samp_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dec_time) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(pta_ext_params),
            "::",
            stringify!(dec_time)
        )
    );
}
#[repr(u32)]
#[doc = " enum nrf_wifi_host_rpu_msg_type - RPU message type\n @NRF_WIFI_HOST_RPU_MSG_TYPE_SYSTEM: Unused\n @NRF_WIFI_HOST_RPU_MSG_TYPE_SUPPLICANT: Unused\n @NRF_WIFI_HOST_RPU_MSG_TYPE_DATA: Data path and System messages\n @NRF_WIFI_HOST_RPU_MSG_TYPE_UMAC: Control path messages\n\n Different categories of messages that can passed between the Host and\n the RPU."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_host_rpu_msg_type {
    NRF_WIFI_HOST_RPU_MSG_TYPE_SYSTEM = 0,
    NRF_WIFI_HOST_RPU_MSG_TYPE_SUPPLICANT = 1,
    NRF_WIFI_HOST_RPU_MSG_TYPE_DATA = 2,
    NRF_WIFI_HOST_RPU_MSG_TYPE_UMAC = 3,
}
#[doc = " struct host_rpu_msg - Message header for HOST-RPU interaction\n @hdr: Message header\n @type: Type of the RPU message\n @msg: Actual message\n\n The common message header that encapsulates each message passed between the\n Host and UMAC."]
#[repr(C, packed)]
pub struct host_rpu_msg {
    pub hdr: host_rpu_msg_hdr,
    pub type_: ::core::ffi::c_int,
    pub msg: __IncompleteArrayField<::core::ffi::c_schar>,
}
#[test]
fn bindgen_test_layout_host_rpu_msg() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_msg> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_msg>(),
        12usize,
        concat!("Size of: ", stringify!(host_rpu_msg))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_msg>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_msg))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(host_rpu_msg), "::", stringify!(hdr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(host_rpu_msg), "::", stringify!(type_))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msg) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(host_rpu_msg), "::", stringify!(msg))
    );
}
#[doc = " struct sta_pend_frames_bitmap - STA pending frames bitmap in SoftAP power save mode.\n @mac_addr: STA MAC address\n @pend_frames_bitmap: Pending frames bitmap for each access category"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sap_pend_frames_bitmap {
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    pub pend_frames_bitmap: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_sap_pend_frames_bitmap() {
    const UNINIT: ::core::mem::MaybeUninit<sap_pend_frames_bitmap> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sap_pend_frames_bitmap>(),
        7usize,
        concat!("Size of: ", stringify!(sap_pend_frames_bitmap))
    );
    assert_eq!(
        ::core::mem::align_of::<sap_pend_frames_bitmap>(),
        1usize,
        concat!("Alignment of ", stringify!(sap_pend_frames_bitmap))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sap_pend_frames_bitmap),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pend_frames_bitmap) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sap_pend_frames_bitmap),
            "::",
            stringify!(pend_frames_bitmap)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_rpu_umac_info {
    pub boot_status: ::core::ffi::c_uint,
    pub version: ::core::ffi::c_uint,
    pub sap_bitmap: [sap_pend_frames_bitmap; 4usize],
    pub hpqm_info: host_rpu_hpqm_info,
    pub info_part: ::core::ffi::c_uint,
    pub info_variant: ::core::ffi::c_uint,
    pub info_lromversion: ::core::ffi::c_uint,
    pub info_uromversion: ::core::ffi::c_uint,
    pub info_uuid: [::core::ffi::c_uint; 4usize],
    pub info_spare0: ::core::ffi::c_uint,
    pub info_spare1: ::core::ffi::c_uint,
    pub mac_address0: [::core::ffi::c_uint; 2usize],
    pub mac_address1: [::core::ffi::c_uint; 2usize],
    pub calib: [::core::ffi::c_uint; 9usize],
}
#[test]
fn bindgen_test_layout_host_rpu_umac_info() {
    const UNINIT: ::core::mem::MaybeUninit<host_rpu_umac_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<host_rpu_umac_info>(),
        184usize,
        concat!("Size of: ", stringify!(host_rpu_umac_info))
    );
    assert_eq!(
        ::core::mem::align_of::<host_rpu_umac_info>(),
        1usize,
        concat!("Alignment of ", stringify!(host_rpu_umac_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boot_status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(boot_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sap_bitmap) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(sap_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpqm_info) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(hpqm_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_part) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_part)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_variant) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_variant)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_lromversion) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_lromversion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_uromversion) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_uromversion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_uuid) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_uuid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_spare0) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_spare0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info_spare1) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(info_spare1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_address0) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(mac_address0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_address1) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(mac_address1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).calib) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(host_rpu_umac_info),
            "::",
            stringify!(calib)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lmac_prod_stats {
    pub reset_cmd_cnt: ::core::ffi::c_uint,
    pub reset_complete_event_cnt: ::core::ffi::c_uint,
    pub unable_gen_event: ::core::ffi::c_uint,
    pub ch_prog_cmd_cnt: ::core::ffi::c_uint,
    pub channel_prog_done: ::core::ffi::c_uint,
    pub tx_pkt_cnt: ::core::ffi::c_uint,
    pub tx_pkt_done_cnt: ::core::ffi::c_uint,
    pub scan_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_done_cnt: ::core::ffi::c_uint,
    pub ack_resp_cnt: ::core::ffi::c_uint,
    pub tx_timeout: ::core::ffi::c_uint,
    pub deagg_isr: ::core::ffi::c_uint,
    pub deagg_inptr_desc_empty: ::core::ffi::c_uint,
    pub deagg_circular_buffer_full: ::core::ffi::c_uint,
    pub lmac_rxisr_cnt: ::core::ffi::c_uint,
    pub rx_decryptcnt: ::core::ffi::c_uint,
    pub process_decrypt_fail: ::core::ffi::c_uint,
    pub prepa_rx_event_fail: ::core::ffi::c_uint,
    pub rx_core_pool_full_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_fail_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_fail_cnt: ::core::ffi::c_uint,
    pub rxDSSSCrcSuccessCnt: ::core::ffi::c_uint,
    pub rxDSSSCrcFailCnt: ::core::ffi::c_uint,
    pub rx_crypto_start_cnt: ::core::ffi::c_uint,
    pub rx_crypto_done_cnt: ::core::ffi::c_uint,
    pub rx_event_buf_full: ::core::ffi::c_uint,
    pub rx_extram_buf_full: ::core::ffi::c_uint,
    pub scan_req: ::core::ffi::c_uint,
    pub scan_complete: ::core::ffi::c_uint,
    pub scan_abort_req: ::core::ffi::c_uint,
    pub scan_abort_complete: ::core::ffi::c_uint,
    pub internal_buf_pool_null: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_lmac_prod_stats() {
    const UNINIT: ::core::mem::MaybeUninit<lmac_prod_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lmac_prod_stats>(),
        140usize,
        concat!("Size of: ", stringify!(lmac_prod_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<lmac_prod_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(lmac_prod_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_cmd_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(reset_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_complete_event_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(reset_complete_event_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unable_gen_event) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(unable_gen_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ch_prog_cmd_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(ch_prog_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_prog_done) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(channel_prog_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cnt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_done_cnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_pkt_cnt) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_cnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_done_cnt) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ack_resp_cnt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(ack_resp_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_timeout) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(tx_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_isr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_inptr_desc_empty) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_inptr_desc_empty)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_circular_buffer_full) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(deagg_circular_buffer_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rxisr_cnt) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(lmac_rxisr_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_decryptcnt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_decryptcnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).process_decrypt_fail) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(process_decrypt_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepa_rx_event_fail) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(prepa_rx_event_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_core_pool_full_cnt) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_core_pool_full_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_success_cnt) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_mpdu_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_fail_cnt) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_mpdu_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_success_cnt) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_ofdm_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_fail_cnt) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_ofdm_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcSuccessCnt) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rxDSSSCrcSuccessCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcFailCnt) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rxDSSSCrcFailCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_start_cnt) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_crypto_start_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_done_cnt) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_crypto_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_event_buf_full) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_event_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_extram_buf_full) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(rx_extram_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_req) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_complete) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_req) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_abort_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_complete) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(scan_abort_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_buf_pool_null) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_prod_stats),
            "::",
            stringify!(internal_buf_pool_null)
        )
    );
}
#[doc = " struct phy_prod_stats : used to get the production mode stats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct phy_prod_stats {
    pub ofdm_crc32_pass_cnt: ::core::ffi::c_uint,
    pub ofdm_crc32_fail_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_pass_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_fail_cnt: ::core::ffi::c_uint,
    pub averageRSSI: ::core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_phy_prod_stats() {
    const UNINIT: ::core::mem::MaybeUninit<phy_prod_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<phy_prod_stats>(),
        20usize,
        concat!("Size of: ", stringify!(phy_prod_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<phy_prod_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(phy_prod_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_pass_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(ofdm_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_fail_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(ofdm_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_pass_cnt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(dsss_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_fail_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(dsss_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).averageRSSI) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(phy_prod_stats),
            "::",
            stringify!(averageRSSI)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rpu_stats {
    pub lmac_stats: lmac_prod_stats,
    pub phy_stats: phy_prod_stats,
}
#[test]
fn bindgen_test_layout_rpu_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_stats>(),
        140usize,
        concat!("Size of: ", stringify!(rpu_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(rpu_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_stats) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rpu_stats), "::", stringify!(lmac_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_stats) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rpu_stats), "::", stringify!(phy_stats))
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct hpqm_queue {
    pub pop_addr: ::core::ffi::c_uint,
    pub push_addr: ::core::ffi::c_uint,
    pub id_num: ::core::ffi::c_uint,
    pub status_addr: ::core::ffi::c_uint,
    pub status_mask: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_hpqm_queue() {
    const UNINIT: ::core::mem::MaybeUninit<hpqm_queue> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<hpqm_queue>(),
        20usize,
        concat!("Size of: ", stringify!(hpqm_queue))
    );
    assert_eq!(
        ::core::mem::align_of::<hpqm_queue>(),
        1usize,
        concat!("Alignment of ", stringify!(hpqm_queue))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pop_addr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(hpqm_queue), "::", stringify!(pop_addr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).push_addr) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(hpqm_queue), "::", stringify!(push_addr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id_num) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(hpqm_queue), "::", stringify!(id_num))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status_addr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(status_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status_mask) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hpqm_queue),
            "::",
            stringify!(status_mask)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct INT_HPQ {
    pub id: ::core::ffi::c_uint,
    pub head: ::core::ffi::c_uint,
    pub tail: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_INT_HPQ() {
    const UNINIT: ::core::mem::MaybeUninit<INT_HPQ> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<INT_HPQ>(),
        12usize,
        concat!("Size of: ", stringify!(INT_HPQ))
    );
    assert_eq!(
        ::core::mem::align_of::<INT_HPQ>(),
        1usize,
        concat!("Alignment of ", stringify!(INT_HPQ))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(INT_HPQ), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(INT_HPQ), "::", stringify!(head))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(INT_HPQ), "::", stringify!(tail))
    );
}
#[doc = " struct lmac_fw_config_params:lmac firmware config params\n @boot_status:\t\tlmac firmware boot status. LMAC will set to\n\t\t\t\t0x5a5a5a5a after completing boot process.\n @rpu_config_name:\t\trpu config name. this is a string and\n\t\t\t\texpected sting is explorer or whisper\n @rpu_config_number:\t\trpu config number\n @HP_lmac_to_host_isr_en:\tlmac register address to enable ISR to Host\n @HP_lmac_to_host_isr_clear:\tAddress to Clear host ISR\n @HP_set_lmac_isr:\t\tAddress to set ISR to lmac Clear host ISR\n @FreeCmdPtrQ:\t\tqueue which contains Free GRAM pointers for\n\t\t\t\tcommands.\n @cmdPtrQ:\t\t\tCommand pointer queue. Host should pick gram\n\t\t\t\tpointer from FreeCmdPtrQ. Populate command in\n\t\t\t\tGRAM and submit back to this queue for RPU.\n @eventPtrQ:\t\t\tEvent pointer queue. Host should pick gram\n\t\t\t\tevent pointer in isr\n @version:\t\t\tlmac firmware version\n\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct lmac_fw_config_params {
    pub boot_status: ::core::ffi::c_uint,
    pub version: ::core::ffi::c_uint,
    pub lmac_rx_buffer_addr: ::core::ffi::c_uint,
    pub lmac_rx_max_desc_cnt: ::core::ffi::c_uint,
    pub lmac_rx_desc_size: ::core::ffi::c_uint,
    pub rpu_config_name: [::core::ffi::c_uchar; 16usize],
    pub rpu_config_number: [::core::ffi::c_uchar; 8usize],
    pub numRX: ::core::ffi::c_uint,
    pub numTX: ::core::ffi::c_uint,
    pub bands: ::core::ffi::c_uint,
    pub sys_frequency_in_mhz: ::core::ffi::c_uint,
    pub FreeCmdPtrQ: hpqm_queue,
    pub cmdPtrQ: hpqm_queue,
    pub eventPtrQ: hpqm_queue,
    pub freeEventPtrQ: hpqm_queue,
    pub SKBGramPtrQ_1: hpqm_queue,
    pub SKBGramPtrQ_2: hpqm_queue,
    pub SKBGramPtrQ_3: hpqm_queue,
    pub HP_lmac_to_host_isr_en: ::core::ffi::c_uint,
    pub HP_lmac_to_host_isr_clear: ::core::ffi::c_uint,
    pub HP_set_lmac_isr: ::core::ffi::c_uint,
    pub hpq32: [INT_HPQ; 4usize],
}
#[test]
fn bindgen_test_layout_lmac_fw_config_params() {
    const UNINIT: ::core::mem::MaybeUninit<lmac_fw_config_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lmac_fw_config_params>(),
        260usize,
        concat!("Size of: ", stringify!(lmac_fw_config_params))
    );
    assert_eq!(
        ::core::mem::align_of::<lmac_fw_config_params>(),
        1usize,
        concat!("Alignment of ", stringify!(lmac_fw_config_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).boot_status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(boot_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_buffer_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_buffer_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_max_desc_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_max_desc_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rx_desc_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(lmac_rx_desc_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_config_name) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(rpu_config_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_config_number) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(rpu_config_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numRX) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(numRX)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numTX) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(numTX)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bands) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(bands)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_frequency_in_mhz) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(sys_frequency_in_mhz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FreeCmdPtrQ) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(FreeCmdPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmdPtrQ) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(cmdPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eventPtrQ) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(eventPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).freeEventPtrQ) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(freeEventPtrQ)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_1) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_2) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SKBGramPtrQ_3) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(SKBGramPtrQ_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_lmac_to_host_isr_en) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_lmac_to_host_isr_en)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_lmac_to_host_isr_clear) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_lmac_to_host_isr_clear)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HP_set_lmac_isr) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(HP_set_lmac_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hpq32) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(lmac_fw_config_params),
            "::",
            stringify!(hpq32)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rx_buf_pool_params {
    pub buf_sz: ::core::ffi::c_ushort,
    pub num_bufs: ::core::ffi::c_ushort,
}
#[test]
fn bindgen_test_layout_rx_buf_pool_params() {
    const UNINIT: ::core::mem::MaybeUninit<rx_buf_pool_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rx_buf_pool_params>(),
        4usize,
        concat!("Size of: ", stringify!(rx_buf_pool_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rx_buf_pool_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rx_buf_pool_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_sz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rx_buf_pool_params),
            "::",
            stringify!(buf_sz)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_bufs) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rx_buf_pool_params),
            "::",
            stringify!(num_bufs)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct temp_vbat_config {
    pub temp_based_calib_en: ::core::ffi::c_uint,
    pub temp_calib_bitmap: ::core::ffi::c_uint,
    pub vbat_calibp_bitmap: ::core::ffi::c_uint,
    pub temp_vbat_mon_period: ::core::ffi::c_uint,
    pub vth_very_low: ::core::ffi::c_int,
    pub vth_low: ::core::ffi::c_int,
    pub vth_hi: ::core::ffi::c_int,
    pub temp_threshold: ::core::ffi::c_int,
    pub vbat_threshold: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_temp_vbat_config() {
    const UNINIT: ::core::mem::MaybeUninit<temp_vbat_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<temp_vbat_config>(),
        36usize,
        concat!("Size of: ", stringify!(temp_vbat_config))
    );
    assert_eq!(
        ::core::mem::align_of::<temp_vbat_config>(),
        1usize,
        concat!("Alignment of ", stringify!(temp_vbat_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_based_calib_en) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_based_calib_en)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_calib_bitmap) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_calib_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_calibp_bitmap) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vbat_calibp_bitmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_vbat_mon_period) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_vbat_mon_period)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_very_low) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_very_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_low) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vth_hi) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vth_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_threshold) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(temp_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vbat_threshold) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(temp_vbat_config),
            "::",
            stringify!(vbat_threshold)
        )
    );
}
impl nrf_wifi_sys_iftype {
    pub const NRF_WIFI_UMAC_IFTYPE_MAX: nrf_wifi_sys_iftype = nrf_wifi_sys_iftype::NRF_WIFI_UMAC_IFTYPE_OCB;
}
#[repr(u32)]
#[doc = " enum nrf_wifi_sys_iftype - Interface types based on functionality.\n\n @NRF_WIFI_UMAC_IFTYPE_UNSPECIFIED: Unspecified type, driver decides.\n @NRF_WIFI_UMAC_IFTYPE_ADHOC: Independent BSS member.\n @NRF_WIFI_UMAC_IFTYPE_STATION: Managed BSS member.\n @NRF_WIFI_UMAC_IFTYPE_AP: Access point.\n @NRF_WIFI_UMAC_IFTYPE_AP_VLAN: VLAN interface for access points; VLAN interfaces\n\tare a bit special in that they must always be tied to a pre-existing\n\tAP type interface.\n @NRF_WIFI_UMAC_IFTYPE_WDS: Wireless Distribution System.\n @NRF_WIFI_UMAC_IFTYPE_MONITOR: Monitor interface receiving all frames.\n @NRF_WIFI_UMAC_IFTYPE_MESH_POINT: Mesh point.\n @NRF_WIFI_UMAC_IFTYPE_P2P_CLIENT: P2P client.\n @NRF_WIFI_UMAC_IFTYPE_P2P_GO: P2P group owner.\n @NRF_WIFI_UMAC_IFTYPE_P2P_DEVICE: P2P device interface type, this is not a netdev\n\tand therefore can't be created in the normal ways, use the\n\t%NRF_WIFI_UMAC_CMD_START_P2P_DEVICE and %NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE\n\tcommands (Refer &enum nrf_wifi_umac_commands) to create and destroy one.\n @NRF_WIFI_UMAC_IFTYPE_OCB: Outside Context of a BSS.\n\tThis mode corresponds to the MIB variable dot11OCBActivated=true.\n @NRF_WIFI_UMAC_IFTYPE_MAX: Highest interface type number currently defined.\n @NRF_WIFI_UMAC_IFTYPES: Number of defined interface types.\n\n Lists the different interface types based on how they are configured\n functionally."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_sys_iftype {
    NRF_WIFI_UMAC_IFTYPE_UNSPECIFIED = 0,
    NRF_WIFI_UMAC_IFTYPE_ADHOC = 1,
    NRF_WIFI_UMAC_IFTYPE_STATION = 2,
    NRF_WIFI_UMAC_IFTYPE_AP = 3,
    NRF_WIFI_UMAC_IFTYPE_AP_VLAN = 4,
    NRF_WIFI_UMAC_IFTYPE_WDS = 5,
    NRF_WIFI_UMAC_IFTYPE_MONITOR = 6,
    NRF_WIFI_UMAC_IFTYPE_MESH_POINT = 7,
    NRF_WIFI_UMAC_IFTYPE_P2P_CLIENT = 8,
    NRF_WIFI_UMAC_IFTYPE_P2P_GO = 9,
    NRF_WIFI_UMAC_IFTYPE_P2P_DEVICE = 10,
    NRF_WIFI_UMAC_IFTYPE_OCB = 11,
    NRF_WIFI_UMAC_IFTYPES = 12,
}
#[repr(u32)]
#[doc = " enum rpu_op_mode - operating modes.\n\n @RPU_OP_MODE_NORMAL: Normal mode is the regular mode of operation\n @RPU_OP_MODE_DBG: Debug mode can be used to control certain parameters\n\tlike TX rate etc in order to debug functional issues\n @RPU_OP_MODE_PROD: Production mode is used for performing production\n\ttests using continuous Tx/Rx on a configured channel at a particular\n\trate, power etc\n @RPU_OP_MODE_FCM: In the FCM mode different type of calibration like RF\n\tcalibration can be performed\n\n Lists the different types of operating modes."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_op_mode {
    RPU_OP_MODE_RADIO_TEST = 0,
    RPU_OP_MODE_FCM = 1,
    RPU_OP_MODE_REG = 2,
    RPU_OP_MODE_DBG = 3,
    RPU_OP_MODE_MAX = 4,
}
#[repr(u32)]
#[doc = " enum rpu_stats_type - statistics type.\n\n To obtain statistics relevant to the operation mode set via op_mode\n parameter."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_stats_type {
    RPU_STATS_TYPE_ALL = 0,
    RPU_STATS_TYPE_HOST = 1,
    RPU_STATS_TYPE_UMAC = 2,
    RPU_STATS_TYPE_LMAC = 3,
    RPU_STATS_TYPE_PHY = 4,
    RPU_STATS_TYPE_MAX = 5,
}
#[repr(u32)]
#[doc = " enum rpu_tput_mode - Throughput mode\n\n Throughput mode to be used for transmitting the packet."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_tput_mode {
    RPU_TPUT_MODE_LEGACY = 0,
    RPU_TPUT_MODE_HT = 1,
    RPU_TPUT_MODE_VHT = 2,
    RPU_TPUT_MODE_HE_SU = 3,
    RPU_TPUT_MODE_HE_ER_SU = 4,
    RPU_TPUT_MODE_HE_TB = 5,
    RPU_TPUT_MODE_MAX = 6,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_sys_commands - system commands\n @NRF_WIFI_CMD_INIT: After host driver bringup host sends the NRF_WIFI_CMD_INIT\n\tto the RPU. then RPU initializes and responds with\n\tNRF_WIFI_EVENT_BUFF_CONFIG.\n @NRF_WIFI_CMD_BUFF_CONFIG_COMPLETE: Host sends this command to RPU after\n\tcompletion of all buffers configuration\n @NRF_WIFI_CMD_TX: command to send a Tx packet\n @NRF_WIFI_CMD_MODE: command to specify mode of operation\n @NRF_WIFI_CMD_GET_STATS: command to get statistics\n @NRF_WIFI_CMD_CLEAR_STATS: command to clear statistics\n @NRF_WIFI_CMD_RX: command to ENABLE/DISABLE receiving packets in radio test mode\n @NRF_WIFI_CMD_DEINIT: RPU De-initialization\n @NRF_WIFI_CMD_HE_GI_LTF_CONFIG: Configure HE_GI & HE_LTF.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_sys_commands {
    NRF_WIFI_CMD_INIT = 0,
    NRF_WIFI_CMD_TX = 1,
    NRF_WIFI_CMD_IF_TYPE = 2,
    NRF_WIFI_CMD_MODE = 3,
    NRF_WIFI_CMD_GET_STATS = 4,
    NRF_WIFI_CMD_CLEAR_STATS = 5,
    NRF_WIFI_CMD_RX = 6,
    NRF_WIFI_CMD_PWR = 7,
    NRF_WIFI_CMD_DEINIT = 8,
    NRF_WIFI_CMD_BTCOEX = 9,
    NRF_WIFI_CMD_RF_TEST = 10,
    NRF_WIFI_CMD_HE_GI_LTF_CONFIG = 11,
    NRF_WIFI_CMD_UMAC_INT_STATS = 12,
    NRF_WIFI_CMD_RADIO_TEST_INIT = 13,
    NRF_WIFI_CMD_RT_REQ_SET_REG = 14,
    NRF_WIFI_CMD_TX_FIX_DATA_RATE = 15,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_sys_events -\n @NRF_WIFI_EVENT_BUFF_CONFIG: Response to NRF_WIFI_CMD_INIT\n\tsee &struct nrf_wifi_event_buffs_config\n @NRF_WIFI_EVENT_BUFF_CONFIG_DONE: Response to NRF_WIFI_CMD_BUFF_CONFIG_COMPLETE\n @NRF_WIFI_EVENT_STATS: Response to NRF_WIFI_CMD_GET_STATS\n @NRF_WIFI_EVENT_DEINIT_DONE: Response to NRF_WIFI_CMD_DEINIT\n\n Events from the RPU for different commands."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_sys_events {
    NRF_WIFI_EVENT_PWR_DATA = 0,
    NRF_WIFI_EVENT_INIT_DONE = 1,
    NRF_WIFI_EVENT_STATS = 2,
    NRF_WIFI_EVENT_DEINIT_DONE = 3,
    NRF_WIFI_EVENT_RF_TEST = 4,
    NRF_WIFI_EVENT_COEX_CONFIG = 5,
    NRF_WIFI_EVENT_INT_UMAC_STATS = 6,
    NRF_WIFI_EVENT_RADIOCMD_STATUS = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_ch_bw {
    RPU_CH_BW_20 = 0,
    RPU_CH_BW_40 = 1,
    RPU_CH_BW_MAX = 2,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct chan_params {
    pub primary_num: ::core::ffi::c_uint,
    pub bw: ::core::ffi::c_uchar,
    pub sec_20_offset: ::core::ffi::c_int,
    pub sec_40_offset: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_chan_params() {
    const UNINIT: ::core::mem::MaybeUninit<chan_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<chan_params>(),
        13usize,
        concat!("Size of: ", stringify!(chan_params))
    );
    assert_eq!(
        ::core::mem::align_of::<chan_params>(),
        1usize,
        concat!("Alignment of ", stringify!(chan_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).primary_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(primary_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bw) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(chan_params), "::", stringify!(bw))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sec_20_offset) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(sec_20_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sec_40_offset) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(chan_params),
            "::",
            stringify!(sec_40_offset)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_conf_rx_radio_test_params {
    pub nss: ::core::ffi::c_uchar,
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    pub chan: chan_params,
    pub phy_threshold: ::core::ffi::c_schar,
    pub phy_calib: ::core::ffi::c_uint,
    pub rx: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_rpu_conf_rx_radio_test_params() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_conf_rx_radio_test_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_conf_rx_radio_test_params>(),
        220usize,
        concat!("Size of: ", stringify!(rpu_conf_rx_radio_test_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_conf_rx_radio_test_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_conf_rx_radio_test_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nss) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(nss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        201usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx) as usize - ptr as usize },
        219usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_rx_radio_test_params),
            "::",
            stringify!(rx)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_rx_dbg_params {
    pub lmac_events: ::core::ffi::c_uint,
    pub rx_events: ::core::ffi::c_uint,
    pub rx_coalesce_events: ::core::ffi::c_uint,
    pub total_rx_pkts_from_lmac: ::core::ffi::c_uint,
    pub max_refill_gap: ::core::ffi::c_uint,
    pub current_refill_gap: ::core::ffi::c_uint,
    pub out_of_order_mpdus: ::core::ffi::c_uint,
    pub reorder_free_mpdus: ::core::ffi::c_uint,
    pub umac_consumed_pkts: ::core::ffi::c_uint,
    pub host_consumed_pkts: ::core::ffi::c_uint,
    pub rx_mbox_post: ::core::ffi::c_uint,
    pub rx_mbox_receive: ::core::ffi::c_uint,
    pub reordering_ampdu: ::core::ffi::c_uint,
    pub timer_mbox_post: ::core::ffi::c_uint,
    pub timer_mbox_rcv: ::core::ffi::c_uint,
    pub work_mbox_post: ::core::ffi::c_uint,
    pub work_mbox_rcv: ::core::ffi::c_uint,
    pub tasklet_mbox_post: ::core::ffi::c_uint,
    pub tasklet_mbox_rcv: ::core::ffi::c_uint,
    pub userspace_offload_frames: ::core::ffi::c_uint,
    pub alloc_buf_fail: ::core::ffi::c_uint,
    pub rx_packet_total_count: ::core::ffi::c_uint,
    pub rx_packet_data_count: ::core::ffi::c_uint,
    pub rx_packet_qos_data_count: ::core::ffi::c_uint,
    pub rx_packet_protected_data_count: ::core::ffi::c_uint,
    pub rx_packet_mgmt_count: ::core::ffi::c_uint,
    pub rx_packet_beacon_count: ::core::ffi::c_uint,
    pub rx_packet_probe_resp_count: ::core::ffi::c_uint,
    pub rx_packet_auth_count: ::core::ffi::c_uint,
    pub rx_packet_deauth_count: ::core::ffi::c_uint,
    pub rx_packet_assoc_resp_count: ::core::ffi::c_uint,
    pub rx_packet_disassoc_count: ::core::ffi::c_uint,
    pub rx_packet_action_count: ::core::ffi::c_uint,
    pub rx_packet_probe_req_count: ::core::ffi::c_uint,
    pub rx_packet_other_mgmt_count: ::core::ffi::c_uint,
    pub max_coalesce_pkts: ::core::ffi::c_schar,
    pub null_skb_pointer_from_lmac: ::core::ffi::c_uint,
    pub unexpected_mgmt_pkt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_rx_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_rx_dbg_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_rx_dbg_params>(),
        149usize,
        concat!("Size of: ", stringify!(umac_rx_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_rx_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_rx_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_events) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(lmac_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_events) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_coalesce_events) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_coalesce_events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_rx_pkts_from_lmac) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(total_rx_pkts_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_refill_gap) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(max_refill_gap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current_refill_gap) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(current_refill_gap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).out_of_order_mpdus) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(out_of_order_mpdus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reorder_free_mpdus) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(reorder_free_mpdus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_consumed_pkts) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(umac_consumed_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_consumed_pkts) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(host_consumed_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mbox_post) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mbox_receive) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_mbox_receive)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reordering_ampdu) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(reordering_ampdu)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timer_mbox_post) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(timer_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timer_mbox_rcv) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(timer_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).work_mbox_post) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(work_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).work_mbox_rcv) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(work_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tasklet_mbox_post) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(tasklet_mbox_post)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tasklet_mbox_rcv) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(tasklet_mbox_rcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).userspace_offload_frames) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(userspace_offload_frames)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).alloc_buf_fail) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(alloc_buf_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_total_count) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_total_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_data_count) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_qos_data_count) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_qos_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_protected_data_count) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_protected_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_mgmt_count) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_beacon_count) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_beacon_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_probe_resp_count) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_probe_resp_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_auth_count) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_auth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_deauth_count) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_deauth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_assoc_resp_count) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_assoc_resp_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_disassoc_count) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_disassoc_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_action_count) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_action_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_probe_req_count) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_probe_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packet_other_mgmt_count) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(rx_packet_other_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_coalesce_pkts) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(max_coalesce_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).null_skb_pointer_from_lmac) as usize - ptr as usize },
        141usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(null_skb_pointer_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unexpected_mgmt_pkt) as usize - ptr as usize },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_rx_dbg_params),
            "::",
            stringify!(unexpected_mgmt_pkt)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_tx_dbg_params {
    pub tx_cmd: ::core::ffi::c_uint,
    pub tx_non_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_max_coalesce_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_cmds_max_used: ::core::ffi::c_uint,
    pub tx_cmds_currently_in_use: ::core::ffi::c_uint,
    pub tx_done_events_send_to_host: ::core::ffi::c_uint,
    pub tx_done_success_pkts_to_host: ::core::ffi::c_uint,
    pub tx_done_failure_pkts_to_host: ::core::ffi::c_uint,
    pub tx_cmds_with_crypto_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_cmds_with_non_crypto_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_cmds_with_broadcast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_cmds_with_multicast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub tx_cmds_with_unicast_pkts_rcvd_from_host: ::core::ffi::c_uint,
    pub xmit: ::core::ffi::c_uint,
    pub send_addba_req: ::core::ffi::c_uint,
    pub addba_resp: ::core::ffi::c_uint,
    pub softmac_tx: ::core::ffi::c_uint,
    pub internal_pkts: ::core::ffi::c_uint,
    pub external_pkts: ::core::ffi::c_uint,
    pub tx_cmds_to_lmac: ::core::ffi::c_uint,
    pub tx_dones_from_lmac: ::core::ffi::c_uint,
    pub total_cmds_to_lmac: ::core::ffi::c_uint,
    pub tx_packet_data_count: ::core::ffi::c_uint,
    pub tx_packet_mgmt_count: ::core::ffi::c_uint,
    pub tx_packet_beacon_count: ::core::ffi::c_uint,
    pub tx_packet_probe_req_count: ::core::ffi::c_uint,
    pub tx_packet_auth_count: ::core::ffi::c_uint,
    pub tx_packet_deauth_count: ::core::ffi::c_uint,
    pub tx_packet_assoc_req_count: ::core::ffi::c_uint,
    pub tx_packet_disassoc_count: ::core::ffi::c_uint,
    pub tx_packet_action_count: ::core::ffi::c_uint,
    pub tx_packet_other_mgmt_count: ::core::ffi::c_uint,
    pub tx_packet_non_mgmt_data_count: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_tx_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_tx_dbg_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_tx_dbg_params>(),
        136usize,
        concat!("Size of: ", stringify!(umac_tx_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_tx_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_tx_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_non_coalesce_pkts_rcvd_from_host) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_non_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_coalesce_pkts_rcvd_from_host) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_max_coalesce_pkts_rcvd_from_host) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_max_coalesce_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_max_used) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_max_used)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_currently_in_use) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_currently_in_use)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_done_events_send_to_host) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_events_send_to_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_done_success_pkts_to_host) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_success_pkts_to_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_done_failure_pkts_to_host) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_done_failure_pkts_to_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_with_crypto_pkts_rcvd_from_host) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_crypto_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_with_non_crypto_pkts_rcvd_from_host) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_non_crypto_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_with_broadcast_pkts_rcvd_from_host) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_broadcast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_with_multicast_pkts_rcvd_from_host) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_multicast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_with_unicast_pkts_rcvd_from_host) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_with_unicast_pkts_rcvd_from_host)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xmit) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(xmit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).send_addba_req) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(send_addba_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addba_resp) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(addba_resp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).softmac_tx) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(softmac_tx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkts) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(internal_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).external_pkts) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(external_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_cmds_to_lmac) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_cmds_to_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_dones_from_lmac) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_dones_from_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_cmds_to_lmac) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(total_cmds_to_lmac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_data_count) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_mgmt_count) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_beacon_count) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_beacon_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_probe_req_count) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_probe_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_auth_count) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_auth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_deauth_count) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_deauth_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_assoc_req_count) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_assoc_req_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_disassoc_count) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_disassoc_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_action_count) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_action_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_other_mgmt_count) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_other_mgmt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packet_non_mgmt_data_count) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_tx_dbg_params),
            "::",
            stringify!(tx_packet_non_mgmt_data_count)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_cmd_evnt_dbg_params {
    pub cmd_init: ::core::ffi::c_uchar,
    pub event_init_done: ::core::ffi::c_uchar,
    pub cmd_rf_test: ::core::ffi::c_uchar,
    pub cmd_connect: ::core::ffi::c_uchar,
    pub cmd_get_stats: ::core::ffi::c_uint,
    pub event_ps_state: ::core::ffi::c_uint,
    pub cmd_set_reg: ::core::ffi::c_uint,
    pub cmd_get_reg: ::core::ffi::c_uint,
    pub cmd_req_set_reg: ::core::ffi::c_uint,
    pub cmd_trigger_scan: ::core::ffi::c_uint,
    pub event_scan_done: ::core::ffi::c_uint,
    pub cmd_get_scan: ::core::ffi::c_uint,
    pub umac_scan_req: ::core::ffi::c_uint,
    pub umac_scan_complete: ::core::ffi::c_uint,
    pub umac_scan_busy: ::core::ffi::c_uint,
    pub cmd_auth: ::core::ffi::c_uint,
    pub cmd_assoc: ::core::ffi::c_uint,
    pub cmd_deauth: ::core::ffi::c_uint,
    pub cmd_register_frame: ::core::ffi::c_uint,
    pub cmd_frame: ::core::ffi::c_uint,
    pub cmd_del_key: ::core::ffi::c_uint,
    pub cmd_new_key: ::core::ffi::c_uint,
    pub cmd_set_key: ::core::ffi::c_uint,
    pub cmd_get_key: ::core::ffi::c_uint,
    pub event_beacon_hint: ::core::ffi::c_uint,
    pub event_reg_change: ::core::ffi::c_uint,
    pub event_wiphy_reg_change: ::core::ffi::c_uint,
    pub cmd_set_station: ::core::ffi::c_uint,
    pub cmd_new_station: ::core::ffi::c_uint,
    pub cmd_del_station: ::core::ffi::c_uint,
    pub cmd_new_interface: ::core::ffi::c_uint,
    pub cmd_set_interface: ::core::ffi::c_uint,
    pub cmd_get_interface: ::core::ffi::c_uint,
    pub cmd_set_ifflags: ::core::ffi::c_uint,
    pub cmd_set_ifflags_done: ::core::ffi::c_uint,
    pub cmd_set_bss: ::core::ffi::c_uint,
    pub cmd_set_wiphy: ::core::ffi::c_uint,
    pub cmd_start_ap: ::core::ffi::c_uint,
    pub LMAC_CMD_PS: ::core::ffi::c_uint,
    pub CURR_STATE: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_umac_cmd_evnt_dbg_params() {
    const UNINIT: ::core::mem::MaybeUninit<umac_cmd_evnt_dbg_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_cmd_evnt_dbg_params>(),
        148usize,
        concat!("Size of: ", stringify!(umac_cmd_evnt_dbg_params))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_cmd_evnt_dbg_params>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_cmd_evnt_dbg_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_init) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_init_done) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_init_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_rf_test) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_rf_test)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_connect) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_connect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_stats) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_stats)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_ps_state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_ps_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_reg) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_reg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_req_set_reg) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_req_set_reg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_trigger_scan) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_trigger_scan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_scan_done) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_scan_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_scan) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_scan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_req) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_complete) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_scan_busy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(umac_scan_busy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_auth) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_auth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_assoc) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_assoc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_deauth) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_deauth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_register_frame) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_register_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_frame) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_del_key) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_del_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_key) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_key) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_key) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_beacon_hint) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_beacon_hint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_reg_change) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_reg_change)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_wiphy_reg_change) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(event_wiphy_reg_change)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_station) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_station) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_del_station) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_del_station)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_new_interface) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_new_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_interface) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_get_interface) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_get_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_ifflags) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_ifflags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_ifflags_done) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_ifflags_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_bss) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_bss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_set_wiphy) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_set_wiphy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_start_ap) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(cmd_start_ap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LMAC_CMD_PS) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(LMAC_CMD_PS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CURR_STATE) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_cmd_evnt_dbg_params),
            "::",
            stringify!(CURR_STATE)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_interface_stats {
    pub tx_unicast_pkt_count: ::core::ffi::c_uint,
    pub tx_multicast_pkt_count: ::core::ffi::c_uint,
    pub tx_broadcast_pkt_count: ::core::ffi::c_uint,
    pub tx_bytes: ::core::ffi::c_uint,
    pub rx_unicast_pkt_count: ::core::ffi::c_uint,
    pub rx_multicast_pkt_count: ::core::ffi::c_uint,
    pub rx_broadcast_pkt_count: ::core::ffi::c_uint,
    pub rx_beacon_success_count: ::core::ffi::c_uint,
    pub rx_beacon_miss_count: ::core::ffi::c_uint,
    pub rx_bytes: ::core::ffi::c_uint,
    pub rx_checksum_error_count: ::core::ffi::c_uint,
    pub replay_attack_drop_cnt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_interface_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_interface_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_interface_stats>(),
        48usize,
        concat!("Size of: ", stringify!(nrf_wifi_interface_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_interface_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_interface_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_unicast_pkt_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_unicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_multicast_pkt_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_multicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_broadcast_pkt_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_broadcast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_bytes) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(tx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_unicast_pkt_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_unicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_multicast_pkt_count) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_multicast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_broadcast_pkt_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_broadcast_pkt_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_beacon_success_count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_beacon_success_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_beacon_miss_count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_beacon_miss_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_bytes) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_checksum_error_count) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(rx_checksum_error_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).replay_attack_drop_cnt) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_interface_stats),
            "::",
            stringify!(replay_attack_drop_cnt)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_umac_stats {
    pub tx_dbg_params: umac_tx_dbg_params,
    pub rx_dbg_params: umac_rx_dbg_params,
    pub cmd_evnt_dbg_params: umac_cmd_evnt_dbg_params,
    pub interface_data_stats: nrf_wifi_interface_stats,
}
#[test]
fn bindgen_test_layout_rpu_umac_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_umac_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_umac_stats>(),
        481usize,
        concat!("Size of: ", stringify!(rpu_umac_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_umac_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_umac_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_dbg_params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(tx_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_dbg_params) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(rx_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_evnt_dbg_params) as usize - ptr as usize },
        285usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(cmd_evnt_dbg_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interface_data_stats) as usize - ptr as usize },
        433usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_umac_stats),
            "::",
            stringify!(interface_data_stats)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_lmac_stats {
    pub reset_cmd_cnt: ::core::ffi::c_uint,
    pub reset_complete_event_cnt: ::core::ffi::c_uint,
    pub unable_gen_event: ::core::ffi::c_uint,
    pub ch_prog_cmd_cnt: ::core::ffi::c_uint,
    pub channel_prog_done: ::core::ffi::c_uint,
    pub tx_pkt_cnt: ::core::ffi::c_uint,
    pub tx_pkt_done_cnt: ::core::ffi::c_uint,
    pub scan_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_cnt: ::core::ffi::c_uint,
    pub internal_pkt_done_cnt: ::core::ffi::c_uint,
    pub ack_resp_cnt: ::core::ffi::c_uint,
    pub tx_timeout: ::core::ffi::c_uint,
    pub deagg_isr: ::core::ffi::c_uint,
    pub deagg_inptr_desc_empty: ::core::ffi::c_uint,
    pub deagg_circular_buffer_full: ::core::ffi::c_uint,
    pub lmac_rxisr_cnt: ::core::ffi::c_uint,
    pub rx_decryptcnt: ::core::ffi::c_uint,
    pub process_decrypt_fail: ::core::ffi::c_uint,
    pub prepa_rx_event_fail: ::core::ffi::c_uint,
    pub rx_core_pool_full_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_mpdu_crc_fail_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_success_cnt: ::core::ffi::c_uint,
    pub rx_ofdm_crc_fail_cnt: ::core::ffi::c_uint,
    pub rxDSSSCrcSuccessCnt: ::core::ffi::c_uint,
    pub rxDSSSCrcFailCnt: ::core::ffi::c_uint,
    pub rx_crypto_start_cnt: ::core::ffi::c_uint,
    pub rx_crypto_done_cnt: ::core::ffi::c_uint,
    pub rx_event_buf_full: ::core::ffi::c_uint,
    pub rx_extram_buf_full: ::core::ffi::c_uint,
    pub scan_req: ::core::ffi::c_uint,
    pub scan_complete: ::core::ffi::c_uint,
    pub scan_abort_req: ::core::ffi::c_uint,
    pub scan_abort_complete: ::core::ffi::c_uint,
    pub internal_buf_pool_null: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_lmac_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_lmac_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_lmac_stats>(),
        140usize,
        concat!("Size of: ", stringify!(rpu_lmac_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_lmac_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_lmac_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_cmd_cnt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(reset_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_complete_event_cnt) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(reset_complete_event_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unable_gen_event) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(unable_gen_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ch_prog_cmd_cnt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(ch_prog_cmd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_prog_done) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(channel_prog_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cnt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_done_cnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_pkt_cnt) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_cnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_pkt_done_cnt) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_pkt_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ack_resp_cnt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(ack_resp_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_timeout) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(tx_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_isr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_isr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_inptr_desc_empty) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_inptr_desc_empty)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deagg_circular_buffer_full) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(deagg_circular_buffer_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac_rxisr_cnt) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(lmac_rxisr_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_decryptcnt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_decryptcnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).process_decrypt_fail) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(process_decrypt_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepa_rx_event_fail) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(prepa_rx_event_fail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_core_pool_full_cnt) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_core_pool_full_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_success_cnt) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_mpdu_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_mpdu_crc_fail_cnt) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_mpdu_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_success_cnt) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_ofdm_crc_success_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_ofdm_crc_fail_cnt) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_ofdm_crc_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcSuccessCnt) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rxDSSSCrcSuccessCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxDSSSCrcFailCnt) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rxDSSSCrcFailCnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_start_cnt) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_crypto_start_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_crypto_done_cnt) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_crypto_done_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_event_buf_full) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_event_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_extram_buf_full) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(rx_extram_buf_full)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_req) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_complete) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_req) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_abort_req)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_abort_complete) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(scan_abort_complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).internal_buf_pool_null) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_lmac_stats),
            "::",
            stringify!(internal_buf_pool_null)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_phy_stats {
    pub rssi_avg: ::core::ffi::c_schar,
    pub pdout_val: ::core::ffi::c_uchar,
    pub ofdm_crc32_pass_cnt: ::core::ffi::c_uint,
    pub ofdm_crc32_fail_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_pass_cnt: ::core::ffi::c_uint,
    pub dsss_crc32_fail_cnt: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_phy_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_phy_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_phy_stats>(),
        18usize,
        concat!("Size of: ", stringify!(rpu_phy_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_phy_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_phy_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rssi_avg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(rssi_avg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pdout_val) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(pdout_val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_pass_cnt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(ofdm_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ofdm_crc32_fail_cnt) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(ofdm_crc32_fail_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_pass_cnt) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(dsss_crc32_pass_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dsss_crc32_fail_cnt) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_phy_stats),
            "::",
            stringify!(dsss_crc32_fail_cnt)
        )
    );
}
#[doc = " struct nrf_wifi_sys_head - Command/Event header.\n @cmd: Command/Event id.\n @len: Payload length.\n\n This header needs to be initialized in every command and has the event\n id info in case of events."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sys_head {
    pub cmd_event: ::core::ffi::c_uint,
    pub len: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_sys_head() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sys_head> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sys_head>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_sys_head))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sys_head>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sys_head))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd_event) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_head),
            "::",
            stringify!(cmd_event)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_head),
            "::",
            stringify!(len)
        )
    );
}
#[doc = " struct bgscan_params - Background Scan parameters.\n @enabled: Enable/Disable background scan.\n @channel_list: List of channels to scan.\n @channel_flags: Channel flags for each of the channels which are to be\n\tscanned.\n @scan_intval: Back ground scan is done at regular intervals. This\n\tvalue is set to the interval value (in ms).\n @channel_dur: Time to be spent on each channel (in ms).\n @serv_channel_dur: In \"Connected State\" scanning, we need to share the time\n\tbetween operating channel and non-operating channels.\n\tAfter scanning each channel, the firmware spends\n\t\"serv_channel_dur\" (in ms) on the operating channel.\n @num_channels: Number of channels to be scanned.\n\n This structure specifies the parameters which will be used during a\n Background Scan."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_bgscan_params {
    pub enabled: ::core::ffi::c_uint,
    pub channel_list: [::core::ffi::c_uchar; 50usize],
    pub channel_flags: [::core::ffi::c_uchar; 50usize],
    pub scan_intval: ::core::ffi::c_uint,
    pub channel_dur: ::core::ffi::c_uint,
    pub serv_channel_dur: ::core::ffi::c_uint,
    pub num_channels: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_bgscan_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_bgscan_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_bgscan_params>(),
        120usize,
        concat!("Size of: ", stringify!(nrf_wifi_bgscan_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_bgscan_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_bgscan_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enabled) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_list) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(channel_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_flags) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(channel_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_intval) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(scan_intval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_dur) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(channel_dur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).serv_channel_dur) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(serv_channel_dur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_channels) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_bgscan_params),
            "::",
            stringify!(num_channels)
        )
    );
}
#[repr(u32)]
#[doc = " enum max_rx_ampdu_size - Max Rx AMPDU size in KB\n\n Max Rx AMPDU Size"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum max_rx_ampdu_size {
    MAX_RX_AMPDU_SIZE_8KB = 0,
    MAX_RX_AMPDU_SIZE_16KB = 1,
    MAX_RX_AMPDU_SIZE_32KB = 2,
    MAX_RX_AMPDU_SIZE_64KB = 3,
}
#[doc = " struct nrf_wifi_data_config_params - Data config parameters\n @rate_protection_type:0->NONE, 1->RTS/CTS, 2->CTS2SELF\n @aggregation: Agreegation is enabled(NRF_WIFI_FEATURE_ENABLE) or disabled\n\t\t(NRF_WIFI_FEATURE_DISABLE)\n @wmm: WMM is enabled(NRF_WIFI_FEATURE_ENABLE) or disabled\n\t\t(NRF_WIFI_FEATURE_DISABLE)\n @max_num_tx_agg_sessions: Max number of aggregated TX sessions\n @max_num_rx_agg_sessions: Max number of aggregated RX sessions\n @reorder_buf_size: Reorder buffer size (1 to 64)\n @max_rxampdu_size: Max RX AMPDU size (8/16/32/64 KB), see\n\t\t\t\t\tenum max_rx_ampdu_size\n\n Data configuration parameters provided in command NRF_WIFI_CMD_INIT"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_data_config_params {
    pub rate_protection_type: ::core::ffi::c_uchar,
    pub aggregation: ::core::ffi::c_uchar,
    pub wmm: ::core::ffi::c_uchar,
    pub max_num_tx_agg_sessions: ::core::ffi::c_uchar,
    pub max_num_rx_agg_sessions: ::core::ffi::c_uchar,
    pub max_tx_aggregation: ::core::ffi::c_uchar,
    pub reorder_buf_size: ::core::ffi::c_uchar,
    pub max_rxampdu_size: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_data_config_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_data_config_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_data_config_params>(),
        11usize,
        concat!("Size of: ", stringify!(nrf_wifi_data_config_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_data_config_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_data_config_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rate_protection_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(rate_protection_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aggregation) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(aggregation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wmm) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(wmm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_num_tx_agg_sessions) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_num_tx_agg_sessions)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_num_rx_agg_sessions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_num_rx_agg_sessions)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_tx_aggregation) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_tx_aggregation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reorder_buf_size) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(reorder_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_rxampdu_size) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_config_params),
            "::",
            stringify!(max_rxampdu_size)
        )
    );
}
#[doc = " struct nrf_wifi_sys_params - Init parameters during NRF_WIFI_CMD_INIT\n @mac_addr: MAC address of the interface\n @sleep_enable: enable rpu sleep\n @hw_bringup_time:\n @sw_bringup_time:\n @bcn_time_out:\n @calib_sleep_clk:\n @rf_params: RF parameters\n @rf_params_valid: Indicates whether the @rf_params has a valid value.\n @phy_calib: PHY calibration parameters\n\n System parameters provided for command NRF_WIFI_CMD_INIT"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sys_params {
    pub sleep_enable: ::core::ffi::c_uint,
    pub hw_bringup_time: ::core::ffi::c_uint,
    pub sw_bringup_time: ::core::ffi::c_uint,
    pub bcn_time_out: ::core::ffi::c_uint,
    pub calib_sleep_clk: ::core::ffi::c_uint,
    pub phy_calib: ::core::ffi::c_uint,
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    pub rf_params_valid: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_sys_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sys_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sys_params>(),
        231usize,
        concat!("Size of: ", stringify!(nrf_wifi_sys_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sys_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sys_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sleep_enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(sleep_enable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_bringup_time) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(hw_bringup_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_bringup_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(sw_bringup_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bcn_time_out) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(bcn_time_out)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).calib_sleep_clk) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(calib_sleep_clk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params_valid) as usize - ptr as usize },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sys_params),
            "::",
            stringify!(rf_params_valid)
        )
    );
}
#[doc = " struct nrf_wifi_tx_pow_ctrl_params - Parameters which control TX power.\n @ant_gain_2g: Antenna gain for 2.4 GHz band.\n @ant_gain_5g_band1 : Antenna gain for 5 GHz band (5150 MHz - 5350 MHz).\n ant_gain_5g_band2 : Antenna gain for 5 GHz band (5470 MHz - 5730 MHz).\n ant_gain_5g_band3 : Antenna gain for 5 GHz band (5730 MHz - 5895 MHz).\n @band_edge_2g_lo: Transmit power backoff (in dB) for lower edge of 2.4 GHz frequency band.\n @band_edge_2g_hi: Transmit power backoff (in dB) for upper edge of 2.4 GHz frequency band.\n @band_edge_5g_unii_1_lo: Transmit power backoff (in dB) for lower edge of UNII-1 frequency band.\n @band_edge_5g_unii_1_hi: Transmit power backoff (in dB) for upper edge of UNII-1 frequency band.\n @band_edge_5g_unii_2a_lo: Transmit power backoff (in dB) for lower edge of UNII-2A frequency band\n @band_edge_5g_unii_2a_hi: Transmit power backoff (in dB) for upper edge of UNII-2A frequency band\n @band_edge_5g_unii_2c_lo: Transmit power backoff (in dB) for lower edge of UNII-2C frequency band\n @band_edge_5g_unii_2c_hi: Transmit power backoff (in dB) for upper edge of UNII-2C frequency band\n @band_edge_5g_unii_3_lo: Transmit power backoff (in dB) for lower edge of UNII-3 frequency band.\n @band_edge_5g_unii_3_hi: Transmit power backoff (in dB) for upper edge of UNII-3 frequency band.\n @band_edge_5g_unii_4_lo: Transmit power backoff (in dB) for lower edge of UNII-4 frequency band.\n @band_edge_5g_unii_4_hi: Transmit power backoff (in dB) for upper edge of UNII-4 frequency band.\n\n System parameters provided for controlling TX power."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_tx_pwr_ctrl_params {
    pub ant_gain_2g: ::core::ffi::c_uchar,
    pub ant_gain_5g_band1: ::core::ffi::c_uchar,
    pub ant_gain_5g_band2: ::core::ffi::c_uchar,
    pub ant_gain_5g_band3: ::core::ffi::c_uchar,
    pub band_edge_2g_lo: ::core::ffi::c_uchar,
    pub band_edge_2g_hi: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_1_lo: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_1_hi: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_2a_lo: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_2a_hi: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_2c_lo: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_2c_hi: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_3_lo: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_3_hi: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_4_lo: ::core::ffi::c_uchar,
    pub band_edge_5g_unii_4_hi: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_pwr_ctrl_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_pwr_ctrl_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_pwr_ctrl_params>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_pwr_ctrl_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_pwr_ctrl_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_pwr_ctrl_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_2g) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_2g)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band1) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ant_gain_5g_band3) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(ant_gain_5g_band3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_2g_lo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_2g_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_2g_hi) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_2g_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_1_lo) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_1_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_1_hi) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_1_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2a_lo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2a_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2a_hi) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2a_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2c_lo) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2c_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_2c_hi) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_2c_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_3_lo) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_3_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_3_hi) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_3_hi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_4_lo) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_4_lo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band_edge_5g_unii_4_hi) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_pwr_ctrl_params),
            "::",
            stringify!(band_edge_5g_unii_4_hi)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum op_band {
    BAND_ALL = 0,
    BAND_24G = 1,
}
#[doc = " struct nrf_wifi_cmd_sys_init - Initialize UMAC\n @sys_head: umac header, see &nrf_wifi_sys_head\n @wdev_id : id of the interface.\n @sys_params: iftype, mac address, see nrf_wifi_sys_params\n @rx_buf_pools: LMAC Rx buffs pool params, see struct rx_buf_pool_params\n @data_config_params: Data configuration params, see struct nrf_wifi_data_config_params\n @tcp_ip_checksum_offload: 0:umac checksum disable 1: umac checksum enable\n @op_band: operating band see enum op_band\n @mgmt_buff_offload: Target selection for management buffers deallocation 0:HOST 1:UMAC.\n After host driver bringup host sends the NRF_WIFI_CMD_INIT to the RPU.\n then RPU initializes and responds with NRF_WIFI_EVENT_BUFF_CONFIG."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_sys_init {
    pub sys_head: nrf_wifi_sys_head,
    pub wdev_id: ::core::ffi::c_uint,
    pub sys_params: nrf_wifi_sys_params,
    pub rx_buf_pools: [rx_buf_pool_params; 3usize],
    pub data_config_params: nrf_wifi_data_config_params,
    pub temp_vbat_config_params: temp_vbat_config,
    pub tcp_ip_checksum_offload: ::core::ffi::c_uchar,
    pub country_code: [::core::ffi::c_uchar; 2usize],
    pub op_band: ::core::ffi::c_uint,
    pub tx_pwr_ctrl_params: nrf_wifi_tx_pwr_ctrl_params,
    pub mgmt_buff_offload: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_sys_init() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_sys_init> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_sys_init>(),
        326usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_sys_init))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_sys_init>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_sys_init))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_params) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(sys_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buf_pools) as usize - ptr as usize },
        243usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(rx_buf_pools)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_config_params) as usize - ptr as usize },
        255usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(data_config_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp_vbat_config_params) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(temp_vbat_config_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tcp_ip_checksum_offload) as usize - ptr as usize },
        302usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(tcp_ip_checksum_offload)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).country_code) as usize - ptr as usize },
        303usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(country_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_band) as usize - ptr as usize },
        305usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(op_band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pwr_ctrl_params) as usize - ptr as usize },
        309usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(tx_pwr_ctrl_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mgmt_buff_offload) as usize - ptr as usize },
        325usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_init),
            "::",
            stringify!(mgmt_buff_offload)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_sys_deinit - De-initialize UMAC\n @sys_head: umac header, see &nrf_wifi_sys_head\n\n De-initializes the RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_sys_deinit {
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_sys_deinit() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_sys_deinit> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_sys_deinit>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_sys_deinit))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_sys_deinit>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_sys_deinit))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_sys_deinit),
            "::",
            stringify!(sys_head)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_he_gi_ltf_config - Confure HE-GI and HE-LTF.\n @sys_head: umac header, see &nrf_wifi_sys_head\n @wdev_id: wdev interface id.\n @he_gi_type: HE GI type(NRF_WIFI_HE_GI_800NS/NRF_WIFI_HE_GI_1600NS/NRF_WIFI_HE_GI_3200NS).\n @he_ltf: HE LTF(NRF_WIFI_HE_LTF_3200NS/NRF_WIFI_HE_LTF_6400NS/NRF_WIFI_HE_LTF_12800NS).\n @enable: Fixed HE GI & LTF values can be enabled and disabled\n Host configures the HE-GI & HE-LTF for testing purpose\n need to use this values in Tx command sending to LMAC."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_he_gi_ltf_config {
    pub sys_head: nrf_wifi_sys_head,
    pub wdev_id: ::core::ffi::c_uchar,
    pub he_gi_type: ::core::ffi::c_uchar,
    pub he_ltf: ::core::ffi::c_uchar,
    pub enable: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_he_gi_ltf_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_he_gi_ltf_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_he_gi_ltf_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_he_gi_ltf_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_he_gi_ltf_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_he_gi_ltf_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_gi_type) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(he_gi_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_ltf) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(he_ltf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_he_gi_ltf_config),
            "::",
            stringify!(enable)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_buff_config_complete {
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_buff_config_complete() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_buff_config_complete> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_buff_config_complete>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_buff_config_complete))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_buff_config_complete>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_buff_config_complete))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_buff_config_complete),
            "::",
            stringify!(sys_head)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rpu_pkt_preamble {
    RPU_PKT_PREAMBLE_SHORT = 0,
    RPU_PKT_PREAMBLE_LONG = 1,
    RPU_PKT_PREAMBLE_MIXED = 2,
    RPU_PKT_PREAMBLE_MAX = 3,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_mode {
    pub sys_head: nrf_wifi_sys_head,
    pub mode: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_mode() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_mode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_mode>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_mode))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_mode>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_mode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_conf_params {
    pub nss: ::core::ffi::c_uchar,
    pub antenna_sel: ::core::ffi::c_uchar,
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    pub tx_pkt_chnl_bw: ::core::ffi::c_uchar,
    pub tx_pkt_tput_mode: ::core::ffi::c_uchar,
    pub tx_pkt_sgi: ::core::ffi::c_uchar,
    pub tx_pkt_nss: ::core::ffi::c_uchar,
    pub tx_pkt_preamble: ::core::ffi::c_uchar,
    pub tx_pkt_stbc: ::core::ffi::c_uchar,
    pub tx_pkt_fec_coding: ::core::ffi::c_uchar,
    pub tx_pkt_mcs: ::core::ffi::c_schar,
    pub tx_pkt_rate: ::core::ffi::c_schar,
    pub phy_threshold: ::core::ffi::c_schar,
    pub phy_calib: ::core::ffi::c_uint,
    pub op_mode: ::core::ffi::c_int,
    pub chan: chan_params,
    pub tx_mode: ::core::ffi::c_uchar,
    pub tx_pkt_num: ::core::ffi::c_int,
    pub tx_pkt_len: ::core::ffi::c_ushort,
    pub tx_power: ::core::ffi::c_uint,
    pub tx: ::core::ffi::c_uchar,
    pub rx: ::core::ffi::c_uchar,
    pub aux_adc_input_chain_id: ::core::ffi::c_uchar,
    pub agg: ::core::ffi::c_uchar,
    pub he_ltf: ::core::ffi::c_uchar,
    pub he_gi: ::core::ffi::c_uchar,
    pub set_he_ltf_gi: ::core::ffi::c_uchar,
    pub power_save: ::core::ffi::c_uchar,
    pub rts_threshold: ::core::ffi::c_uint,
    pub uapsd_queue: ::core::ffi::c_uint,
    pub tx_pkt_gap_us: ::core::ffi::c_uint,
    pub wlan_ant_switch_ctrl: ::core::ffi::c_uchar,
    pub ble_ant_switch_ctrl: ::core::ffi::c_uchar,
    pub ru_tone: ::core::ffi::c_uchar,
    pub ru_index: ::core::ffi::c_uchar,
    pub tx_tone_freq: ::core::ffi::c_schar,
    pub lna_gain: ::core::ffi::c_uchar,
    pub bb_gain: ::core::ffi::c_uchar,
    pub capture_length: ::core::ffi::c_ushort,
    pub bypass_regulatory: ::core::ffi::c_uchar,
    pub country_code: [::core::ffi::c_uchar; 2usize],
    pub tx_pkt_cw: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_rpu_conf_params() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_conf_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_conf_params>(),
        280usize,
        concat!("Size of: ", stringify!(rpu_conf_params))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_conf_params>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_conf_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nss) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rpu_conf_params), "::", stringify!(nss))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).antenna_sel) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(antenna_sel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_chnl_bw) as usize - ptr as usize },
        202usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_chnl_bw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_tput_mode) as usize - ptr as usize },
        203usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_tput_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_sgi) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_sgi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_nss) as usize - ptr as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_nss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_preamble) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_preamble)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_stbc) as usize - ptr as usize },
        207usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_stbc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_fec_coding) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_fec_coding)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_mcs) as usize - ptr as usize },
        209usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_mcs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_rate) as usize - ptr as usize },
        210usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        211usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(phy_calib)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_mode) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(op_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        220usize,
        concat!("Offset of field: ", stringify!(rpu_conf_params), "::", stringify!(chan))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_mode) as usize - ptr as usize },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_num) as usize - ptr as usize },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_len) as usize - ptr as usize },
        238usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_power) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_power)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx) as usize - ptr as usize },
        244usize,
        concat!("Offset of field: ", stringify!(rpu_conf_params), "::", stringify!(tx))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx) as usize - ptr as usize },
        245usize,
        concat!("Offset of field: ", stringify!(rpu_conf_params), "::", stringify!(rx))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aux_adc_input_chain_id) as usize - ptr as usize },
        246usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(aux_adc_input_chain_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).agg) as usize - ptr as usize },
        247usize,
        concat!("Offset of field: ", stringify!(rpu_conf_params), "::", stringify!(agg))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_ltf) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(he_ltf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).he_gi) as usize - ptr as usize },
        249usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(he_gi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_he_ltf_gi) as usize - ptr as usize },
        250usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(set_he_ltf_gi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).power_save) as usize - ptr as usize },
        251usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(power_save)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rts_threshold) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(rts_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uapsd_queue) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(uapsd_queue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_gap_us) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_gap_us)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wlan_ant_switch_ctrl) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(wlan_ant_switch_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ble_ant_switch_ctrl) as usize - ptr as usize },
        265usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ble_ant_switch_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_tone) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ru_tone)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_index) as usize - ptr as usize },
        267usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(ru_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_tone_freq) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_tone_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lna_gain) as usize - ptr as usize },
        269usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(lna_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bb_gain) as usize - ptr as usize },
        270usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(bb_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).capture_length) as usize - ptr as usize },
        271usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(capture_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bypass_regulatory) as usize - ptr as usize },
        273usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(bypass_regulatory)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).country_code) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(country_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pkt_cw) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_conf_params),
            "::",
            stringify!(tx_pkt_cw)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_mode_params\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head\n @conf: configuration parameters of different modes see &union rpu_conf_params\n\n configures the RPU with config parameters provided in this command"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_mode_params {
    pub sys_head: nrf_wifi_sys_head,
    pub conf: rpu_conf_params,
    pub pkt_length: [::core::ffi::c_ushort; 16usize],
    pub ddr_ptrs: [::core::ffi::c_uint; 16usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_mode_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_mode_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_mode_params>(),
        384usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_mode_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_mode_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_mode_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pkt_length) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(pkt_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ddr_ptrs) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_mode_params),
            "::",
            stringify!(ddr_ptrs)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_radio_test_init - command radio_test_init\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head\n @conf: radiotest init configuration parameters\n see &struct nrf_wifi_radio_test_init_info\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_radio_test_init_info {
    pub rf_params: [::core::ffi::c_uchar; 200usize],
    pub chan: chan_params,
    pub phy_threshold: ::core::ffi::c_schar,
    pub phy_calib: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_radio_test_init_info() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_radio_test_init_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_radio_test_init_info>(),
        218usize,
        concat!("Size of: ", stringify!(nrf_wifi_radio_test_init_info))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_radio_test_init_info>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_radio_test_init_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_params) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(rf_params)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chan) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_threshold) as usize - ptr as usize },
        213usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(phy_threshold)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy_calib) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_radio_test_init_info),
            "::",
            stringify!(phy_calib)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_radio_test_init {
    pub sys_head: nrf_wifi_sys_head,
    pub conf: nrf_wifi_radio_test_init_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_radio_test_init() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_radio_test_init> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_radio_test_init>(),
        226usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_radio_test_init))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_radio_test_init>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_radio_test_init))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_radio_test_init),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_radio_test_init),
            "::",
            stringify!(conf)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_rx - command rx\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head\n @conf: rx configuration parameters see &struct rpu_conf_rx_radio_test_params\n @:rx_enable: 1-Enable Rx to receive packets contineously on specified channel\n\t0-Disable Rx stop receiving packets and clear statistics\n\n Command RPU to Enable/Disable Rx"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_rx {
    pub sys_head: nrf_wifi_sys_head,
    pub conf: rpu_conf_rx_radio_test_params,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_rx() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_rx> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_rx>(),
        228usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_rx))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_rx>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_rx))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rx),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(nrf_wifi_cmd_rx), "::", stringify!(conf))
    );
}
#[doc = " struct nrf_wifi_cmd_get_stats - Get statistics\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head\n @stats_type: Statistics type see &enum rpu_stats_type\n @op_mode: Production mode or FCM mode\n\n This command is to Request the statistics corresponding to stats_type\n selected\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_get_stats {
    pub sys_head: nrf_wifi_sys_head,
    pub stats_type: ::core::ffi::c_int,
    pub op_mode: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_get_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_get_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_get_stats>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_get_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_get_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_get_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stats_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(stats_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op_mode) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_get_stats),
            "::",
            stringify!(op_mode)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_clear_stats - clear statistics\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n @stats_type: Type of statistics to clear see &enum rpu_stats_type\n\n This command is to clear the statistics corresponding to stats_type selected"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_clear_stats {
    pub sys_head: nrf_wifi_sys_head,
    pub stats_type: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_clear_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_clear_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_clear_stats>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_clear_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_clear_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_clear_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_clear_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stats_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_clear_stats),
            "::",
            stringify!(stats_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_pwr {
    pub sys_head: nrf_wifi_sys_head,
    pub data_type: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_pwr() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_pwr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_pwr>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_pwr))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_pwr>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_pwr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_pwr),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_pwr),
            "::",
            stringify!(data_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct coex_wlan_switch_ctrl {
    pub rpu_msg_id: ::core::ffi::c_int,
    pub switch_A: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_coex_wlan_switch_ctrl() {
    const UNINIT: ::core::mem::MaybeUninit<coex_wlan_switch_ctrl> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<coex_wlan_switch_ctrl>(),
        8usize,
        concat!("Size of: ", stringify!(coex_wlan_switch_ctrl))
    );
    assert_eq!(
        ::core::mem::align_of::<coex_wlan_switch_ctrl>(),
        1usize,
        concat!("Alignment of ", stringify!(coex_wlan_switch_ctrl))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_msg_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(coex_wlan_switch_ctrl),
            "::",
            stringify!(rpu_msg_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).switch_A) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(coex_wlan_switch_ctrl),
            "::",
            stringify!(switch_A)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_btcoex {
    pub sys_head: nrf_wifi_sys_head,
    pub conf: coex_wlan_switch_ctrl,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_btcoex() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_btcoex> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_btcoex>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_btcoex))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_btcoex>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_btcoex))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_btcoex),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).conf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_btcoex),
            "::",
            stringify!(conf)
        )
    );
}
#[repr(C, packed)]
pub struct rpu_cmd_coex_config_info {
    pub len: ::core::ffi::c_uint,
    pub coex_cmd: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_cmd_coex_config_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_cmd_coex_config_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_cmd_coex_config_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_cmd_coex_config_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_cmd_coex_config_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_cmd_coex_config_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_coex_config_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_cmd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_coex_config_info),
            "::",
            stringify!(coex_cmd)
        )
    );
}
#[repr(C, packed)]
pub struct nrf_wifi_cmd_coex_config {
    pub sys_head: nrf_wifi_sys_head,
    pub coex_config_info: rpu_cmd_coex_config_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_coex_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_coex_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_coex_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_coex_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_coex_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_coex_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_coex_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_config_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_coex_config),
            "::",
            stringify!(coex_config_info)
        )
    );
}
#[repr(C, packed)]
pub struct rpu_evnt_coex_config_info {
    pub len: ::core::ffi::c_uint,
    pub coex_event: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_evnt_coex_config_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_evnt_coex_config_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_evnt_coex_config_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_evnt_coex_config_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_evnt_coex_config_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_evnt_coex_config_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_coex_config_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_event) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_coex_config_info),
            "::",
            stringify!(coex_event)
        )
    );
}
#[repr(C, packed)]
pub struct nrf_wifi_event_coex_config {
    pub sys_head: nrf_wifi_sys_head,
    pub coex_config_info: rpu_evnt_coex_config_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_coex_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_coex_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_coex_config>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_coex_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_coex_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_coex_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_coex_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_config_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_coex_config),
            "::",
            stringify!(coex_config_info)
        )
    );
}
#[doc = " struct nrf_wifi_cmd_fix_tx_rate - UMAC deinitialization done\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n rate_flags: refer &enum rpu_tput_mode.\n fixed_rate: -1 Disable fixed rate and use ratecontrol selected rate.\n             >0 legacy rates: 1,2,55,11,6,9,12,18,24,36,48,54.\n                11N VHT HE  : MCS index 0 to 7."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_cmd_fix_tx_rate {
    pub sys_head: nrf_wifi_sys_head,
    pub rate_flags: ::core::ffi::c_uchar,
    pub fixed_rate: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_fix_tx_rate() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_fix_tx_rate> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_fix_tx_rate>(),
        13usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_fix_tx_rate))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_fix_tx_rate>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_fix_tx_rate))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rate_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(rate_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fixed_rate) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_fix_tx_rate),
            "::",
            stringify!(fixed_rate)
        )
    );
}
#[repr(C, packed)]
pub struct rpu_cmd_rftest_info {
    pub len: ::core::ffi::c_uint,
    pub rfcmd: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_cmd_rftest_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_cmd_rftest_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_cmd_rftest_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_cmd_rftest_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_cmd_rftest_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_cmd_rftest_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_rftest_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rfcmd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_cmd_rftest_info),
            "::",
            stringify!(rfcmd)
        )
    );
}
#[repr(C, packed)]
pub struct nrf_wifi_cmd_rftest {
    pub sys_head: nrf_wifi_sys_head,
    pub rf_test_info: rpu_cmd_rftest_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_cmd_rftest() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_cmd_rftest> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_cmd_rftest>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_cmd_rftest))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_cmd_rftest>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_cmd_rftest))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rftest),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_test_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_cmd_rftest),
            "::",
            stringify!(rf_test_info)
        )
    );
}
#[repr(C, packed)]
pub struct rpu_evnt_rftest_info {
    pub len: ::core::ffi::c_uint,
    pub rfevent: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_rpu_evnt_rftest_info() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_evnt_rftest_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_evnt_rftest_info>(),
        4usize,
        concat!("Size of: ", stringify!(rpu_evnt_rftest_info))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_evnt_rftest_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_evnt_rftest_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_rftest_info),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rfevent) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rpu_evnt_rftest_info),
            "::",
            stringify!(rfevent)
        )
    );
}
#[repr(C, packed)]
pub struct nrf_wifi_event_rftest {
    pub sys_head: nrf_wifi_sys_head,
    pub rf_test_info: rpu_evnt_rftest_info,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_rftest() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_rftest> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_rftest>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_rftest))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_rftest>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_rftest))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_rftest),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rf_test_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_rftest),
            "::",
            stringify!(rf_test_info)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_pwr_data {
    pub sys_head: nrf_wifi_sys_head,
    pub mon_status: ::core::ffi::c_int,
    pub data_type: ::core::ffi::c_int,
    pub data: nrf_wifi_rpu_pwr_data,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_pwr_data() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_pwr_data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_pwr_data>(),
        28usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_pwr_data))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_pwr_data>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_pwr_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mon_status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(mon_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(data_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_pwr_data),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " struct rpu_fw_stats - FW statistics\n @phy:  PHY statistics  see &struct rpu_phy_stats\n @lmac: LMAC statistics see &struct rpu_lmac_stats\n @umac: UMAC statistics see &struct rpu_umac_stats\n\n This structure is a combination of all the statistics that the RPU firmware\n can provide\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct rpu_fw_stats {
    pub phy: rpu_phy_stats,
    pub lmac: rpu_lmac_stats,
    pub umac: rpu_umac_stats,
}
#[test]
fn bindgen_test_layout_rpu_fw_stats() {
    const UNINIT: ::core::mem::MaybeUninit<rpu_fw_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rpu_fw_stats>(),
        639usize,
        concat!("Size of: ", stringify!(rpu_fw_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<rpu_fw_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(rpu_fw_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).phy) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rpu_fw_stats), "::", stringify!(phy))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lmac) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(rpu_fw_stats), "::", stringify!(lmac))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac) as usize - ptr as usize },
        158usize,
        concat!("Offset of field: ", stringify!(rpu_fw_stats), "::", stringify!(umac))
    );
}
#[doc = " struct nrf_wifi_umac_event_stats - statistics event\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n @fw: All the statistics that the firmware can provide.\n\n This event is the response to command NRF_WIFI_CMD_GET_STATS.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_umac_event_stats {
    pub sys_head: nrf_wifi_sys_head,
    pub fw: rpu_fw_stats,
}
#[test]
fn bindgen_test_layout_nrf_wifi_umac_event_stats() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_umac_event_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_umac_event_stats>(),
        647usize,
        concat!("Size of: ", stringify!(nrf_wifi_umac_event_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_umac_event_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_umac_event_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_stats),
            "::",
            stringify!(fw)
        )
    );
}
#[repr(u32)]
#[doc = " struct nrf_wifi_umac_event_cmd_err_status - cmd error indication\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n @status: status of the command ie Fail(Type of err) or success.\n\n This event is the response to command chanl_prog.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_radio_test_err_status {
    NRF_WIFI_UMAC_CMD_SUCCESS = 1,
    NRF_WIFI_UMAC_INVALID_CHNL = 2,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_umac_event_err_status {
    pub sys_head: nrf_wifi_sys_head,
    pub status: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_umac_event_err_status() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_umac_event_err_status> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_umac_event_err_status>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_umac_event_err_status))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_umac_event_err_status>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_umac_event_err_status))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_err_status),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_event_err_status),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " struct nrf_wifi_event_buff_config_done - Buffers configuration done\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n @mac_addr: Mac address of the RPU\n\n RPU sends this event in response to NRF_WIFI_CMD_BUFF_CONFIG_COMPLETE informing\n RPU is initialized"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_buff_config_done {
    pub sys_head: nrf_wifi_sys_head,
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_buff_config_done() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_buff_config_done> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_buff_config_done>(),
        14usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_buff_config_done))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_buff_config_done>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_buff_config_done))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buff_config_done),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buff_config_done),
            "::",
            stringify!(mac_addr)
        )
    );
}
#[doc = " struct nrf_wifi_txrx_buffs_config - TX/RX buffers config event.\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n @max_tx_descs: Max number of tx descriptors.\n @max_2k_rx_descs: Max number of 2k rx descriptors.\n @num_8k_rx_descs: Max number of 2k rx descriptors.\n @num_mgmt_descs: Max number of mgmt buffers.\n\n After initialization RPU sends NRF_WIFI_EVENT_BUFF_CONFIG\n to inform host regarding descriptors.\n 8K buffer are for internal purpose. At initialization time host\n submits the 8K buffer and UMAC uses buffers to configure LMAC\n for receiving AMSDU packets."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_buffs_config {
    pub sys_head: nrf_wifi_sys_head,
    pub max_tx_descs: ::core::ffi::c_uint,
    pub max_2k_rx_descs: ::core::ffi::c_uint,
    pub num_8k_rx_descs: ::core::ffi::c_uint,
    pub num_mgmt_descs: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_buffs_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_buffs_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_buffs_config>(),
        24usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_buffs_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_buffs_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_buffs_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buffs_config),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_tx_descs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buffs_config),
            "::",
            stringify!(max_tx_descs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_2k_rx_descs) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buffs_config),
            "::",
            stringify!(max_2k_rx_descs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_8k_rx_descs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buffs_config),
            "::",
            stringify!(num_8k_rx_descs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_mgmt_descs) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_buffs_config),
            "::",
            stringify!(num_mgmt_descs)
        )
    );
}
#[doc = " struct nrf_wifi_event_init_done - UMAC initialization done\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n\n RPU sends this event in response to NRF_WIFI_CMD_INIT indicating that the RPU is\n initialized"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_init_done {
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_init_done() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_init_done> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_init_done>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_init_done))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_init_done>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_init_done))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_init_done),
            "::",
            stringify!(sys_head)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pool_data_to_host {
    pub buffer_size: ::core::ffi::c_uint,
    pub num_pool_items: ::core::ffi::c_uchar,
    pub items_num_max_allocated: ::core::ffi::c_uchar,
    pub items_num_cur_allocated: ::core::ffi::c_uchar,
    pub items_num_total_allocated: ::core::ffi::c_uint,
    pub items_num_not_allocated: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_pool_data_to_host() {
    const UNINIT: ::core::mem::MaybeUninit<pool_data_to_host> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pool_data_to_host>(),
        15usize,
        concat!("Size of: ", stringify!(pool_data_to_host))
    );
    assert_eq!(
        ::core::mem::align_of::<pool_data_to_host>(),
        1usize,
        concat!("Alignment of ", stringify!(pool_data_to_host))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(buffer_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_pool_items) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(num_pool_items)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_max_allocated) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_max_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_cur_allocated) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_cur_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_total_allocated) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_total_allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).items_num_not_allocated) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(pool_data_to_host),
            "::",
            stringify!(items_num_not_allocated)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct umac_int_stats {
    pub sys_head: nrf_wifi_sys_head,
    pub scratch_dynamic_memory_info: [pool_data_to_host; 56usize],
    pub retention_dynamic_memory_info: [pool_data_to_host; 56usize],
}
#[test]
fn bindgen_test_layout_umac_int_stats() {
    const UNINIT: ::core::mem::MaybeUninit<umac_int_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<umac_int_stats>(),
        1688usize,
        concat!("Size of: ", stringify!(umac_int_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<umac_int_stats>(),
        1usize,
        concat!("Alignment of ", stringify!(umac_int_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
            "::",
            stringify!(sys_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scratch_dynamic_memory_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
            "::",
            stringify!(scratch_dynamic_memory_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).retention_dynamic_memory_info) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(umac_int_stats),
            "::",
            stringify!(retention_dynamic_memory_info)
        )
    );
}
#[doc = " struct nrf_wifi_event_deinit_done - UMAC deinitialization done\n @sys_head: UMAC header, See &struct nrf_wifi_sys_head.\n\n RPU sends this event in response to NRF_WIFI_CMD_DEINIT indicating that the RPU is\n deinitialized"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_event_deinit_done {
    pub sys_head: nrf_wifi_sys_head,
}
#[test]
fn bindgen_test_layout_nrf_wifi_event_deinit_done() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_event_deinit_done> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_event_deinit_done>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_event_deinit_done))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_event_deinit_done>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_event_deinit_done))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_event_deinit_done),
            "::",
            stringify!(sys_head)
        )
    );
}
#[repr(u32)]
#[doc = " enum nrf_wifi_umac_data_commands - UMAC init and data buffer command/events\n\n @NRF_WIFI_CMD_MGMT_BUFF_CONFIG: Configure MGMT frame buffer.\n\tSee &struct nrf_wifi_rx_buff_config\n @NRF_WIFI_CMD_TX_BUFF: Transmit data packet.\n\tSee &struct nrf_wifi_tx_buff\n @NRF_WIFI_CMD_TX_BUFF_DONE: TX done event.\n\tSee &struct nrf_wifi_tx_buff_done\n @NRF_WIFI_CMD_RX_BUFF: RX data event.\n\tSee &struct nrf_wifi_rx_buff\n @NRF_WIFI_CMD_CARRIER_ON: STA connection complete event.\n\tSee &struct nrf_wifi_data_carrier_state\n @NRF_WIFI_CMD_CARRIER_OFF: STA disconnected event.\n\tSee &struct nrf_wifi_data_carrier_state\n @NRF_WIFI_CMD_PM_MODE: SoftAP client power save event.\n\tSee &struct nrf_wifi_sap_client_pwrsave\n @NRF_WIFI_CMD_PS_GET_FRAMES: SoftAP client PS get frames event.\n\tSee &struct nrf_wifi_sap_ps_get_frames\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_umac_data_commands {
    NRF_WIFI_CMD_MGMT_BUFF_CONFIG = 0,
    NRF_WIFI_CMD_TX_BUFF = 1,
    NRF_WIFI_CMD_TX_BUFF_DONE = 2,
    NRF_WIFI_CMD_RX_BUFF = 3,
    NRF_WIFI_CMD_CARRIER_ON = 4,
    NRF_WIFI_CMD_CARRIER_OFF = 5,
    NRF_WIFI_CMD_PM_MODE = 6,
    NRF_WIFI_CMD_PS_GET_FRAMES = 7,
}
#[doc = " struct nrf_wifi_umac_head - Command/Event header.\n @cmd: Command/Event id.\n @len: Payload length.\n\n This header needs to be initialized in every command and has the event\n id info in case of events."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_umac_head {
    pub cmd: ::core::ffi::c_uint,
    pub len: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_umac_head() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_umac_head> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_umac_head>(),
        8usize,
        concat!("Size of: ", stringify!(nrf_wifi_umac_head))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_umac_head>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_umac_head))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_head),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_umac_head),
            "::",
            stringify!(len)
        )
    );
}
#[doc = " struct nrf_wifi_packet_info - Data packet frame pointers.\n @head: Pointer to the start of headroom.\n @data: Potiner to the start of data/actual frame data.\n @tail: End of frame data.\n @end: End of tailroom.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_packet_info {
    pub head: ::core::ffi::c_uint,
    pub data: ::core::ffi::c_uint,
    pub tail: ::core::ffi::c_uint,
    pub end: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_packet_info() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_packet_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_packet_info>(),
        16usize,
        concat!("Size of: ", stringify!(nrf_wifi_packet_info))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_packet_info>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_packet_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_packet_info),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_packet_info),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_packet_info),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_packet_info),
            "::",
            stringify!(end)
        )
    );
}
#[doc = " struct nrf_wifi_mgmt_buff_config - Configure management buffers.\n @umac_head: UMAC cmd header, See &struct nrf_wifi_umac_hdr.\n @num_mgmt_bufs: Number of Mgmt buffers to be configured.\n @ddr_ptrs: Management DDR buffer pointers.\n\n Management buffers once programmed will be used internally by UMAC."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_mgmt_buff_config {
    pub umac_head: nrf_wifi_umac_head,
    pub num_mgmt_bufs: ::core::ffi::c_uint,
    pub ddr_ptrs: [::core::ffi::c_uint; 16usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_mgmt_buff_config() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_mgmt_buff_config> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_mgmt_buff_config>(),
        76usize,
        concat!("Size of: ", stringify!(nrf_wifi_mgmt_buff_config))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_mgmt_buff_config>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_mgmt_buff_config))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_mgmt_buff_config),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_mgmt_bufs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_mgmt_buff_config),
            "::",
            stringify!(num_mgmt_bufs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ddr_ptrs) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_mgmt_buff_config),
            "::",
            stringify!(ddr_ptrs)
        )
    );
}
#[repr(u32)]
#[doc = " HEADER_FILL_FLAGS - mac80211 header filled information.\n @FC_POPULATED: Frame Control field is populated by Host Driver.\n @DUR_POPULATED: Duration field is populated by Host Driver.\n @ADDR1_POPULATED: Address 1 field is populated by Host Driver.\n @ADDR2_POPULATED: Address 2 field is populated by Host Driver.\n @ADDR3_POPULATED: Address 3 field is populated by Host Driver.\n @SEQ_CTRL_POPULATED: Sequence Control field is populated by Host Driver.\n @QOS_CTRL_POPULATED: Qos field is populated by Host Driver.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum HEADER_FILL_FLAGS {
    FC_POPULATED = 2,
    DUR_POPULATED = 4,
    ADDR1_POPULATED = 8,
    ADDR2_POPULATED = 16,
    ADDR3_POPULATED = 32,
    SEQ_CTRL_POPULATED = 64,
    QOS_CTRL_POPULATED = 128,
}
#[doc = " struct tx_mac_hdr_info - Tx mac80211 header information.\n @umac_head: UMAC cmd header, See &struct nrf_wifi_umac_hdr.\n @umac_fill_flags: Flags indicates which of the following fields present.\n @fc: Frame Control.\n @more_data: 0-> No more Data, 1-> More Data\n @dest: Destination Address.\n @src: Source Address.\n @etype: Ethernet type.\n @dscp_or_tos: Type of Service.\n @more_data:more frames queued\n @eosp: End Of Service Period flag(applicable in U-APSD)\n\n Host fills the mac80211 header fields and indicates to UMAC."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct tx_mac_hdr_info {
    pub umac_fill_flags: ::core::ffi::c_int,
    pub fc: ::core::ffi::c_ushort,
    pub dest: [::core::ffi::c_uchar; 6usize],
    pub src: [::core::ffi::c_uchar; 6usize],
    pub etype: ::core::ffi::c_ushort,
    pub dscp_or_tos: ::core::ffi::c_uint,
    pub more_data: ::core::ffi::c_uchar,
    pub eosp: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_tx_mac_hdr_info() {
    const UNINIT: ::core::mem::MaybeUninit<tx_mac_hdr_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<tx_mac_hdr_info>(),
        26usize,
        concat!("Size of: ", stringify!(tx_mac_hdr_info))
    );
    assert_eq!(
        ::core::mem::align_of::<tx_mac_hdr_info>(),
        1usize,
        concat!("Alignment of ", stringify!(tx_mac_hdr_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_fill_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tx_mac_hdr_info),
            "::",
            stringify!(umac_fill_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fc) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(tx_mac_hdr_info), "::", stringify!(fc))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dest) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(tx_mac_hdr_info), "::", stringify!(dest))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(tx_mac_hdr_info), "::", stringify!(src))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).etype) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(tx_mac_hdr_info),
            "::",
            stringify!(etype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dscp_or_tos) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tx_mac_hdr_info),
            "::",
            stringify!(dscp_or_tos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).more_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tx_mac_hdr_info),
            "::",
            stringify!(more_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eosp) as usize - ptr as usize },
        25usize,
        concat!("Offset of field: ", stringify!(tx_mac_hdr_info), "::", stringify!(eosp))
    );
}
#[doc = " struct nrf_wifi_tx_buff_info - TX data command info.\n @pkt_length: Tx packet length.\n @ddr_ptr: Tx packet data pointer."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_tx_buff_info {
    pub pkt_length: ::core::ffi::c_ushort,
    pub ddr_ptr: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_buff_info() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_buff_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_buff_info>(),
        6usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_buff_info))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_buff_info>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_buff_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pkt_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_info),
            "::",
            stringify!(pkt_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ddr_ptr) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_info),
            "::",
            stringify!(ddr_ptr)
        )
    );
}
#[doc = " struct nrf_wifi_tx_buff - Send TX packet.\n @umac_head: UMAC cmd header. See &struct nrf_wifi_umac_hdr.\n @wdev_id: wdev interface id.\n @tx_desc_num: Descriptor id.\n @mac_hdr_info: Common mac header for all packets to be Txed.\n @pending_buf_size: Pending buffer at host\n @num_tx_pkts: Number of packets.\n @tx_buff_info: See nrf_wifi_tx_buff_info_t for details, the array size can be maximum\n\tof MAX_TX_AGG_SIZE\n\n Host sends the packet information which needs to transmit by\n using %NRF_WIFI_CMD_TX_BUFF."]
#[repr(C, packed)]
pub struct nrf_wifi_tx_buff {
    pub umac_head: nrf_wifi_umac_head,
    pub wdev_id: ::core::ffi::c_uchar,
    pub tx_desc_num: ::core::ffi::c_uchar,
    pub mac_hdr_info: tx_mac_hdr_info,
    pub pending_buf_size: ::core::ffi::c_uint,
    pub num_tx_pkts: ::core::ffi::c_uchar,
    pub tx_buff_info: __IncompleteArrayField<nrf_wifi_tx_buff_info>,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_buff() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_buff> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_buff>(),
        41usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_buff))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_buff>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_buff))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_desc_num) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(tx_desc_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_hdr_info) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(mac_hdr_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pending_buf_size) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(pending_buf_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_tx_pkts) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(num_tx_pkts)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_buff_info) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff),
            "::",
            stringify!(tx_buff_info)
        )
    );
}
#[doc = " struct nrf_wifi_tx_buff_done - TX done event.\n @umac_head: UMAC event header. See &struct nrf_wifi_umac_hdr.\n @tx_desc_num: Descriptor id.\n @num_tx_status_code: Total number of received tx status code, the array size can be maximum\n\tof MAX_TX_AGG_SIZE\n @timestamp_t1: Frame sent time at Phy\n @timestamp_t4: Frame ack received time at Phy\n @tx_status_code: Status of TX packet.\n\n RPU acknowledges the packet transmition by using %NRF_WIFI_CMD_TX_BUFF_DONE."]
#[repr(C, packed)]
pub struct nrf_wifi_tx_buff_done {
    pub umac_head: nrf_wifi_umac_head,
    pub tx_desc_num: ::core::ffi::c_uchar,
    pub num_tx_status_code: ::core::ffi::c_uchar,
    pub timestamp_t1: [::core::ffi::c_uchar; 6usize],
    pub timestamp_t4: [::core::ffi::c_uchar; 6usize],
    pub tx_status_code: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[test]
fn bindgen_test_layout_nrf_wifi_tx_buff_done() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_tx_buff_done> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_tx_buff_done>(),
        22usize,
        concat!("Size of: ", stringify!(nrf_wifi_tx_buff_done))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_tx_buff_done>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_tx_buff_done))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_desc_num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(tx_desc_num)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_tx_status_code) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(num_tx_status_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp_t1) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(timestamp_t1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp_t4) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(timestamp_t4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_status_code) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_tx_buff_done),
            "::",
            stringify!(tx_status_code)
        )
    );
}
#[repr(u32)]
#[doc = " enum nrf_wifi_rx_pkt_type: The Received packet type\n @NRF_WIFI_RX_PKT_DATA: The Rx packet is of type data.\n @NRF_WIFI_RX_PKT_BCN_PRB_RSP: The RX packet is of type beacon or probe response\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_rx_pkt_type {
    NRF_WIFI_RX_PKT_DATA = 0,
    NRF_WIFI_RX_PKT_BCN_PRB_RSP = 1,
}
#[doc = " struct nrf_wifi_rx_buff_info - RX data event info.\n @descriptor_id: Descriptor id.\n @rx_pkt_len: Rx packet length.\n @timestamp_t2: Frame received time at Phy\n @timestamp_t3: Ack sent time at Phy"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_rx_buff_info {
    pub descriptor_id: ::core::ffi::c_ushort,
    pub rx_pkt_len: ::core::ffi::c_ushort,
    pub pkt_type: ::core::ffi::c_uchar,
    pub timestamp_t2: [::core::ffi::c_uchar; 6usize],
    pub timestamp_t3: [::core::ffi::c_uchar; 6usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_rx_buff_info() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_rx_buff_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_rx_buff_info>(),
        17usize,
        concat!("Size of: ", stringify!(nrf_wifi_rx_buff_info))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_rx_buff_info>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_rx_buff_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).descriptor_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff_info),
            "::",
            stringify!(descriptor_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_pkt_len) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff_info),
            "::",
            stringify!(rx_pkt_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff_info),
            "::",
            stringify!(pkt_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp_t2) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff_info),
            "::",
            stringify!(timestamp_t2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp_t3) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff_info),
            "::",
            stringify!(timestamp_t3)
        )
    );
}
#[doc = " struct nrf_wifi_rx_buf - RX data event.\n @umac_head: UMAC event header. See &struct nrf_wifi_umac_hdr.\n @wdev_id: wdev interface id.\n @rx_pkt_cnt: Number of packets received.\n @rx_pkt_type: Rx packet type.\n After receiving the RX packet RPU informs the host using NRF_WIFI_CMD_RX_BUFF.\n Host refills the buffer using NRF_WIFI_CMD_2K_RX_BUFF_CONFIG."]
#[repr(C, packed)]
pub struct nrf_wifi_rx_buff {
    pub umac_head: nrf_wifi_umac_head,
    pub rx_pkt_type: ::core::ffi::c_int,
    pub wdev_id: ::core::ffi::c_uchar,
    pub rx_pkt_cnt: ::core::ffi::c_uchar,
    pub rpu_align_offset: ::core::ffi::c_uchar,
    pub mac_header_len: ::core::ffi::c_uchar,
    pub frequency: ::core::ffi::c_ushort,
    pub signal: ::core::ffi::c_short,
    pub rx_buff_info: __IncompleteArrayField<nrf_wifi_rx_buff_info>,
}
#[test]
fn bindgen_test_layout_nrf_wifi_rx_buff() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_rx_buff> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_rx_buff>(),
        20usize,
        concat!("Size of: ", stringify!(nrf_wifi_rx_buff))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_rx_buff>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_rx_buff))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_pkt_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(rx_pkt_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_pkt_cnt) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(rx_pkt_cnt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rpu_align_offset) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(rpu_align_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_header_len) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(mac_header_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(frequency)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signal) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(signal)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_buff_info) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_rx_buff),
            "::",
            stringify!(rx_buff_info)
        )
    );
}
#[doc = " struct nrf_wifi_data_carrier_state - Carrier state info.\n @umac_head: UMAC event header. See &struct nrf_wifi_umac_hdr."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_data_carrier_state {
    pub umac_head: nrf_wifi_umac_head,
    pub wdev_id: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout_nrf_wifi_data_carrier_state() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_data_carrier_state> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_data_carrier_state>(),
        12usize,
        concat!("Size of: ", stringify!(nrf_wifi_data_carrier_state))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_data_carrier_state>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_data_carrier_state))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_carrier_state),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_data_carrier_state),
            "::",
            stringify!(wdev_id)
        )
    );
}
#[doc = " struct nrf_wifi_sap_client_pwrsave - SofAP client power save info.\n @umac_head: UMAC event header. See &struct nrf_wifi_umac_hdr.\n @wdev_id: wdev interface id.\n @sta_ps_state: NRF_WIFI_CLIENT_ACTIVE or NRF_WIFI_CLIENT_PS_MODE\n @mac_addr: STA MAC Address"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sap_client_pwrsave {
    pub umac_head: nrf_wifi_umac_head,
    pub wdev_id: ::core::ffi::c_uint,
    pub sta_ps_state: ::core::ffi::c_uchar,
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_sap_client_pwrsave() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sap_client_pwrsave> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sap_client_pwrsave>(),
        19usize,
        concat!("Size of: ", stringify!(nrf_wifi_sap_client_pwrsave))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sap_client_pwrsave>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sap_client_pwrsave))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_client_pwrsave),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_client_pwrsave),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sta_ps_state) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_client_pwrsave),
            "::",
            stringify!(sta_ps_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_client_pwrsave),
            "::",
            stringify!(mac_addr)
        )
    );
}
#[doc = " struct nrf_wifi_sap_ps_get_frames - SofAP client PS get frames info.\n @umac_head: UMAC event header. See &struct nrf_wifi_umac_hdr.\n @wdev_id: wdev interface id.\n @mac_addr: STA MAC Address\n @num_frames: Num frames to transmit in service period"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sap_ps_get_frames {
    pub umac_head: nrf_wifi_umac_head,
    pub wdev_id: ::core::ffi::c_uint,
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    pub num_frames: ::core::ffi::c_schar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_sap_ps_get_frames() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sap_ps_get_frames> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sap_ps_get_frames>(),
        19usize,
        concat!("Size of: ", stringify!(nrf_wifi_sap_ps_get_frames))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sap_ps_get_frames>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sap_ps_get_frames))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).umac_head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_ps_get_frames),
            "::",
            stringify!(umac_head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_ps_get_frames),
            "::",
            stringify!(wdev_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_ps_get_frames),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_frames) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sap_ps_get_frames),
            "::",
            stringify!(num_frames)
        )
    );
}
#[repr(u32)]
#[doc = " enum nrf_wifi_umac_commands - Commands that the host can send to the RPU.\n\n @NRF_WIFI_UMAC_CMD_TRIGGER_SCAN: Trigger a new scan with the given parameters.\n\tSee &struct nrf_wifi_umac_cmd_scan\n @NRF_WIFI_UMAC_CMD_GET_SCAN_RESULTS: Request for scan results.\n\tSee &struct nrf_wifi_umac_cmd_get_scan_results\n @NRF_WIFI_UMAC_CMD_AUTHENTICATE: Send authentication request to AP.\n\tSee &struct nrf_wifi_umac_cmd_auth\n @NRF_WIFI_UMAC_CMD_ASSOCIATE: Send associate request to AP.\n\tSee &struct nrf_wifi_umac_cmd_assoc\n @NRF_WIFI_UMAC_CMD_DEAUTHENTICATE: Send deauthentication request to AP.\n\tSee &struct nrf_wifi_umac_cmd_disconn\n @NRF_WIFI_UMAC_CMD_SET_WIPHY: Set wiphy parameters.\n\tSee &struct nrf_wifi_umac_cmd_set_wiphy\n @NRF_WIFI_UMAC_CMD_NEW_KEY: Add new key.\n\tSee &struct nrf_wifi_umac_cmd_key\n @NRF_WIFI_UMAC_CMD_DEL_KEY: Delete crypto key.\n\tSee &struct nrf_wifi_umac_cmd_key\n @NRF_WIFI_UMAC_CMD_SET_KEY: Set default key to use.\n\tSee &struct nrf_wifi_umac_cmd_set_key\n @NRF_WIFI_UMAC_CMD_GET_KEY: Unused.\n @NRF_WIFI_UMAC_CMD_NEW_BEACON: Set the beacon fields in AP mode.\n\tSee &struct nrf_wifi_umac_cmd_start_ap\n @NRF_WIFI_UMAC_CMD_SET_BEACON: Set the beacon fields in AP mode.\n\tSee &struct nrf_wifi_umac_cmd_set_beacon\n @NRF_WIFI_UMAC_CMD_SET_BSS: Set the BSS.\n\tSee &struct nrf_wifi_umac_cmd_set_bss\n @NRF_WIFI_UMAC_CMD_START_AP: Start the device as Soft AP.\n\tSee &struct nrf_wifi_umac_cmd_start_ap\n @NRF_WIFI_UMAC_CMD_STOP_AP: Stop the AP mode.\n\tSee &struct nrf_wifi_umac_cmd_stop_ap\n @NRF_WIFI_UMAC_CMD_NEW_INTERFACE: Adding interface.\n\tSee &struct nrf_wifi_umac_cmd_add_vif\n @NRF_WIFI_UMAC_CMD_SET_INTERFACE: Change interface configuration.\n\tSee &struct nrf_wifi_umac_cmd_chg_vif_attr\n @NRF_WIFI_UMAC_CMD_DEL_INTERFACE: Delete interface.\n\tSee &struct nrf_wifi_umac_cmd_del_vif\n @NRF_WIFI_UMAC_CMD_SET_IFFLAGS: Change interface flags.\n\tSee &struct nrf_wifi_umac_cmd_chg_vif_state\n @NRF_WIFI_UMAC_CMD_NEW_STATION: Add a new station.\n\tSee &struct nrf_wifi_umac_cmd_add_sta\n @NRF_WIFI_UMAC_CMD_DEL_STATION: Delete station.\n\tSee &struct nrf_wifi_umac_cmd_del_sta\n @NRF_WIFI_UMAC_CMD_SET_STATION: Change station info.\n\tSee &struct nrf_wifi_umac_cmd_chg_sta\n @NRF_WIFI_UMAC_CMD_GET_STATION: Get station info.\n\tSee &struct nrf_wifi_umac_cmd_get_sta\n @NRF_WIFI_UMAC_CMD_START_P2P_DEVICE: Start the P2P device.\n\tSee &struct nrf_wifi_umac_cmd_start_p2p_dev\n @NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE: Stop the P2P device.\n\tSee &struct nrf_wifi_umac_cmd_stop_p2p_dev\n @NRF_WIFI_UMAC_CMD_REMAIN_ON_CHANNEL: Unused.\n @NRF_WIFI_UMAC_CMD_CANCEL_REMAIN_ON_CHANNEL: Unused.\n @NRF_WIFI_UMAC_CMD_SET_CHANNEL: Unused.\n @NRF_WIFI_UMAC_CMD_RADAR_DETECT: Unused.\n @NRF_WIFI_UMAC_CMD_REGISTER_FRAME: Whitelist filter based on frame types.\n\tSee &struct nrf_wifi_umac_cmd_mgmt_frame_reg\n @NRF_WIFI_UMAC_CMD_FRAME: Send a management frame.\n\tSee &struct nrf_wifi_umac_cmd_mgmt_tx\n @NRF_WIFI_UMAC_CMD_JOIN_IBSS: Unused.\n @NRF_WIFI_UMAC_CMD_WIN_STA_CONNECT: Connect to AP.\n\tSee &struct nrf_wifi_umac_cmd_win_sta_connect\n @NRF_WIFI_UMAC_CMD_SET_POWER_SAVE: Power save Enable/Disable\n\tSee &struct nrf_wifi_umac_cmd_set_power_save\n @NRF_WIFI_UMAC_CMD_SET_WOWLAN: Set the WoWLAN trigger configs\n\tSee &struct nrf_wifi_umac_cmd_set_wowlan\n @NRF_WIFI_UMAC_CMD_SUSPEND: Suspend the bus after WoWLAN configurations\n\tSee &struct nrf_wifi_umac_cmd_suspend\n @NRF_WIFI_UMAC_CMD_RESUME: Resume the bus activity before wakeup\n\tSee &struct nrf_wifi_umac_cmd_resume\n @NRF_WIFI_UMAC_CMD_GET_CHANNEL: Get Channel info\n\t\tSee &struct nrf_wifi_umac_cmd_get_channel\n @NRF_WIFI_UMAC_CMD_GET_TX_POWER: Get Tx power level\n\t\tSee &struct nrf_wifi_umac_cmd_get_tx_power\n @NRF_WIFI_UMAC_CMD_GET_REG : Get Regulatory info\n\t\tSee &struct nrf_wifi_reg_t\n @NRF_WIFI_UMAC_CMD_SET_REG : Set Regulatory info\n\t\tSee &struct nrf_wifi_reg_t\n\n Lists the different ID's to be used to when sending a command to the RPU.\n All the commands are to be encapsulated using struct host_rpu_msg."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_umac_commands {
    NRF_WIFI_UMAC_CMD_TRIGGER_SCAN = 0,
    NRF_WIFI_UMAC_CMD_GET_SCAN_RESULTS = 1,
    NRF_WIFI_UMAC_CMD_AUTHENTICATE = 2,
    NRF_WIFI_UMAC_CMD_ASSOCIATE = 3,
    NRF_WIFI_UMAC_CMD_DEAUTHENTICATE = 4,
    NRF_WIFI_UMAC_CMD_SET_WIPHY = 5,
    NRF_WIFI_UMAC_CMD_NEW_KEY = 6,
    NRF_WIFI_UMAC_CMD_DEL_KEY = 7,
    NRF_WIFI_UMAC_CMD_SET_KEY = 8,
    NRF_WIFI_UMAC_CMD_GET_KEY = 9,
    NRF_WIFI_UMAC_CMD_NEW_BEACON = 10,
    NRF_WIFI_UMAC_CMD_SET_BEACON = 11,
    NRF_WIFI_UMAC_CMD_SET_BSS = 12,
    NRF_WIFI_UMAC_CMD_START_AP = 13,
    NRF_WIFI_UMAC_CMD_STOP_AP = 14,
    NRF_WIFI_UMAC_CMD_NEW_INTERFACE = 15,
    NRF_WIFI_UMAC_CMD_SET_INTERFACE = 16,
    NRF_WIFI_UMAC_CMD_DEL_INTERFACE = 17,
    NRF_WIFI_UMAC_CMD_SET_IFFLAGS = 18,
    NRF_WIFI_UMAC_CMD_NEW_STATION = 19,
    NRF_WIFI_UMAC_CMD_DEL_STATION = 20,
    NRF_WIFI_UMAC_CMD_SET_STATION = 21,
    NRF_WIFI_UMAC_CMD_GET_STATION = 22,
    NRF_WIFI_UMAC_CMD_START_P2P_DEVICE = 23,
    NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE = 24,
    NRF_WIFI_UMAC_CMD_REMAIN_ON_CHANNEL = 25,
    NRF_WIFI_UMAC_CMD_CANCEL_REMAIN_ON_CHANNEL = 26,
    NRF_WIFI_UMAC_CMD_SET_CHANNEL = 27,
    NRF_WIFI_UMAC_CMD_RADAR_DETECT = 28,
    NRF_WIFI_UMAC_CMD_REGISTER_FRAME = 29,
    NRF_WIFI_UMAC_CMD_FRAME = 30,
    NRF_WIFI_UMAC_CMD_JOIN_IBSS = 31,
    NRF_WIFI_UMAC_CMD_WIN_STA_CONNECT = 32,
    NRF_WIFI_UMAC_CMD_SET_POWER_SAVE = 33,
    NRF_WIFI_UMAC_CMD_SET_WOWLAN = 34,
    NRF_WIFI_UMAC_CMD_SUSPEND = 35,
    NRF_WIFI_UMAC_CMD_RESUME = 36,
    NRF_WIFI_UMAC_CMD_SET_QOS_MAP = 37,
    NRF_WIFI_UMAC_CMD_GET_CHANNEL = 38,
    NRF_WIFI_UMAC_CMD_GET_TX_POWER = 39,
    NRF_WIFI_UMAC_CMD_GET_INTERFACE = 40,
    NRF_WIFI_UMAC_CMD_GET_WIPHY = 41,
    NRF_WIFI_UMAC_CMD_GET_IFHWADDR = 42,
    NRF_WIFI_UMAC_CMD_SET_IFHWADDR = 43,
    NRF_WIFI_UMAC_CMD_GET_REG = 44,
    NRF_WIFI_UMAC_CMD_SET_REG = 45,
    NRF_WIFI_UMAC_CMD_REQ_SET_REG = 46,
    NRF_WIFI_UMAC_CMD_CONFIG_UAPSD = 47,
    NRF_WIFI_UMAC_CMD_CONFIG_TWT = 48,
    NRF_WIFI_UMAC_CMD_TEARDOWN_TWT = 49,
    NRF_WIFI_UMAC_CMD_ABORT_SCAN = 50,
    NRF_WIFI_UMAC_CMD_MCAST_FILTER = 51,
    NRF_WIFI_UMAC_CMD_CHANGE_MACADDR = 52,
    NRF_WIFI_UMAC_CMD_SET_POWER_SAVE_TIMEOUT = 53,
    NRF_WIFI_UMAC_CMD_GET_CONNECTION_INFO = 54,
    NRF_WIFI_UMAC_CMD_GET_POWER_SAVE_INFO = 55,
    NRF_WIFI_UMAC_CMD_SET_LISTEN_INTERVAL = 56,
    NRF_WIFI_UMAC_CMD_CONFIG_EXTENDED_PS = 57,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_umac_events - Events that the RPU can send to the host.\n\n @NRF_WIFI_UMAC_EVENT_TRIGGER_SCAN_START: Unused.\n @NRF_WIFI_UMAC_EVENT_SCAN_ABORTED: Indicate scan has been cancelled.\n\tSee &struct nrf_wifi_umac_event_trigger_scan\n @NRF_WIFI_UMAC_EVENT_SCAN_DONE: Indicate scan results are available.\n\tSee &struct nrf_wifi_umac_event_trigger_scan\n @NRF_WIFI_UMAC_EVENT_SCAN_RESULT: Scan result. We will receive one event for all\n\tthe scan results until umac_hdr->seq == 0.\n\tSee &struct nrf_wifi_umac_event_new_scan_results\n @NRF_WIFI_UMAC_EVENT_AUTHENTICATE: Authentication status.\n\tSee &struct nrf_wifi_umac_event_mlme\n @NRF_WIFI_UMAC_EVENT_ASSOCIATE: Association status.\n\tSee &struct nrf_wifi_umac_event_mlme\n @NRF_WIFI_UMAC_EVENT_CONNECT: Connection complete event.\n\tSee &struct nrf_wifi_umac_event_connect\n @NRF_WIFI_UMAC_EVENT_DEAUTHENTICATE: Station deauth event.\n\tSee &struct nrf_wifi_umac_event_mlme\n @NRF_WIFI_UMAC_EVENT_NEW_STATION: Station added indication.\n\tSee &struct nrf_wifi_umac_event_new_station\n @NRF_WIFI_UMAC_EVENT_DEL_STATION: Station deleted indication.\n\tSee &struct nrf_wifi_umac_event_new_station\n @NRF_WIFI_UMAC_EVENT_GET_STATION: Station info indication.\n\tSee &nrf_wifi_umac_event_station_t\n @NRF_WIFI_UMAC_EVENT_REMAIN_ON_CHANNEL: Unused.\n @NRF_WIFI_UMAC_EVENT_CANCEL_REMAIN_ON_CHANNEL: Unused.\n @NRF_WIFI_UMAC_EVENT_DISCONNECT: Unused.\n @NRF_WIFI_UMAC_EVENT_FRAME: RX management frame.\n\tSee &struct nrf_wifi_umac_event_mlme\n @NRF_WIFI_UMAC_EVENT_COOKIE_RESP: Cookie mapping for NRF_WIFI_UMAC_CMD_FRAME.\n\tSee &struct nrf_wifi_umac_event_cookie_rsp\n @NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS: TX management frame transmitted.\n\tSee &struct nrf_wifi_umac_event_mlme\n @NRF_WIFI_UMAC_EVENT_GET_CHANNEL: Send Channel info.\n\tSee &struct nrf_wifi_umac_event_get_channel\n @NRF_WIFI_UMAC_EVENT_GET_TX_POWER: Send Tx power.\n\tSee &struct nrf_wifi_umac_event_get_tx_power\n @NRF_WIFI_UMAC_EVENT_SET_INTERFACE: NRF_WIFI_UMAC_CMD_SET_INTERFACE status.\n\tSee &struct nrf_wifi_umac_event_set_interface\n @NRF_WIFI_UMAC_EVENT_GET_REG: NRF_WIFI_UMAC_CMD_GET_REG status\n\tSee &struct nrf_wifi_reg_t\n @NRF_WIFI_UMAC_EVENT_SET_REG: NRF_WIFI_UMAC_CMD_SET_REG status\n\tSee &struct nrf_wifi_reg_t\n @NRF_WIFI_UMAC_EVENT_REQ_SET_REG: NRF_WIFI_UMAC_CMD_REQ_SET_REG status\n\tSee &struct nrf_wifi_reg_t\n @NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT: Scan display result. We will receive one event for all\n\tthe scan results until umac_hdr->seq == 0\n Lists the ID's to used by the RPU when sending a Event to the Host. All the\n events are encapsulated using struct host_rpu_msg."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_umac_events {
    NRF_WIFI_UMAC_EVENT_UNSPECIFIED = 256,
    NRF_WIFI_UMAC_EVENT_TRIGGER_SCAN_START = 257,
    NRF_WIFI_UMAC_EVENT_SCAN_ABORTED = 258,
    NRF_WIFI_UMAC_EVENT_SCAN_DONE = 259,
    NRF_WIFI_UMAC_EVENT_SCAN_RESULT = 260,
    NRF_WIFI_UMAC_EVENT_AUTHENTICATE = 261,
    NRF_WIFI_UMAC_EVENT_ASSOCIATE = 262,
    NRF_WIFI_UMAC_EVENT_CONNECT = 263,
    NRF_WIFI_UMAC_EVENT_DEAUTHENTICATE = 264,
    NRF_WIFI_UMAC_EVENT_DISASSOCIATE = 265,
    NRF_WIFI_UMAC_EVENT_NEW_STATION = 266,
    NRF_WIFI_UMAC_EVENT_DEL_STATION = 267,
    NRF_WIFI_UMAC_EVENT_GET_STATION = 268,
    NRF_WIFI_UMAC_EVENT_REMAIN_ON_CHANNEL = 269,
    NRF_WIFI_UMAC_EVENT_CANCEL_REMAIN_ON_CHANNEL = 270,
    NRF_WIFI_UMAC_EVENT_DISCONNECT = 271,
    NRF_WIFI_UMAC_EVENT_FRAME = 272,
    NRF_WIFI_UMAC_EVENT_COOKIE_RESP = 273,
    NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS = 274,
    NRF_WIFI_UMAC_EVENT_IFFLAGS_STATUS = 275,
    NRF_WIFI_UMAC_EVENT_GET_TX_POWER = 276,
    NRF_WIFI_UMAC_EVENT_GET_CHANNEL = 277,
    NRF_WIFI_UMAC_EVENT_SET_INTERFACE = 278,
    NRF_WIFI_UMAC_EVENT_UNPROT_DEAUTHENTICATE = 279,
    NRF_WIFI_UMAC_EVENT_UNPROT_DISASSOCIATE = 280,
    NRF_WIFI_UMAC_EVENT_NEW_INTERFACE = 281,
    NRF_WIFI_UMAC_EVENT_NEW_WIPHY = 282,
    NRF_WIFI_UMAC_EVENT_GET_IFHWADDR = 283,
    NRF_WIFI_UMAC_EVENT_GET_REG = 284,
    NRF_WIFI_UMAC_EVENT_SET_REG = 285,
    NRF_WIFI_UMAC_EVENT_REQ_SET_REG = 286,
    NRF_WIFI_UMAC_EVENT_GET_KEY = 287,
    NRF_WIFI_UMAC_EVENT_BEACON_HINT = 288,
    NRF_WIFI_UMAC_EVENT_REG_CHANGE = 289,
    NRF_WIFI_UMAC_EVENT_WIPHY_REG_CHANGE = 290,
    NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT = 291,
    NRF_WIFI_UMAC_EVENT_CMD_STATUS = 292,
    NRF_WIFI_UMAC_EVENT_BSS_INFO = 293,
    NRF_WIFI_UMAC_EVENT_CONFIG_TWT = 294,
    NRF_WIFI_UMAC_EVENT_TEARDOWN_TWT = 295,
    NRF_WIFI_UMAC_EVENT_TWT_SLEEP = 296,
    NRF_WIFI_UMAC_EVENT_COALESCING = 297,
    NRF_WIFI_UMAC_EVENT_MCAST_FILTER = 298,
    NRF_WIFI_UMAC_EVENT_GET_CONNECTION_INFO = 299,
    NRF_WIFI_UMAC_EVENT_GET_POWER_SAVE_INFO = 300,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_band - Frequency band.\n\n @NRF_WIFI_BAND_2GHZ: 2.4 GHz ISM band.\n @NRF_WIFI_BAND_5GHZ: Around 5 GHz band (4.9 - 5.7 GHz).\n @NRF_WIFI_BAND_60GHZ: Unused.\n\n This enum represents the values that can be used to specify which frequency\n band is used."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_band {
    NRF_WIFI_BAND_2GHZ = 0,
    NRF_WIFI_BAND_5GHZ = 1,
    NRF_WIFI_BAND_60GHZ = 2,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_mfp - Management frame protection state.\n\n @NRF_WIFI_MFP_NO: Management frame protection not used.\n @NRF_WIFI_MFP_REQUIRED: Management frame protection required.\n\n Enabling/Disabling of Management Frame Protection."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_mfp {
    NRF_WIFI_MFP_NO = 0,
    NRF_WIFI_MFP_REQUIRED = 1,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_key_type - Key Type\n\n @NRF_WIFI_KEYTYPE_GROUP: Group (broadcast/multicast) key\n @NRF_WIFI_KEYTYPE_PAIRWISE: Pairwise (unicast/individual) key\n @NRF_WIFI_KEYTYPE_PEERKEY: Peer key (DLS)\n @NUM_NRF_WIFI_KEYTYPES: Number of defined key types\n\n Lists the different categories of security keys."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_key_type {
    NRF_WIFI_KEYTYPE_GROUP = 0,
    NRF_WIFI_KEYTYPE_PAIRWISE = 1,
    NRF_WIFI_KEYTYPE_PEERKEY = 2,
    NUM_NRF_WIFI_KEYTYPES = 3,
}
impl nrf_wifi_auth_type {
    pub const NRF_WIFI_AUTHTYPE_MAX: nrf_wifi_auth_type = nrf_wifi_auth_type::__NRF_WIFI_AUTHTYPE_NUM;
}
#[repr(u32)]
#[doc = " enum nrf_wifi_auth_type - Authentication Type.\n\n @NRF_WIFI_AUTHTYPE_OPEN_SYSTEM: Open System authentication.\n @NRF_WIFI_AUTHTYPE_SHARED_KEY: Shared Key authentication (WEP only).\n @NRF_WIFI_AUTHTYPE_FT: Fast BSS Transition (IEEE 802.11r).\n @NRF_WIFI_AUTHTYPE_NETWORK_EAP: Network EAP (some Cisco APs and mainly LEAP).\n @NRF_WIFI_AUTHTYPE_SAE: Simultaneous authentication of equals.\n @__NRF_WIFI_AUTHTYPE_NUM: Internal.\n @NRF_WIFI_AUTHTYPE_MAX: Maximum valid auth algorithm.\n @NRF_WIFI_AUTHTYPE_AUTOMATIC: Determine automatically (if necessary by\n\ttrying multiple times); this is invalid in netlink -- leave out\n\tthe attribute for this on CONNECT commands.\n\n Lists the different types of authentication mechanisms."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_auth_type {
    NRF_WIFI_AUTHTYPE_OPEN_SYSTEM = 0,
    NRF_WIFI_AUTHTYPE_SHARED_KEY = 1,
    NRF_WIFI_AUTHTYPE_FT = 2,
    NRF_WIFI_AUTHTYPE_NETWORK_EAP = 3,
    NRF_WIFI_AUTHTYPE_SAE = 4,
    __NRF_WIFI_AUTHTYPE_NUM = 5,
    NRF_WIFI_AUTHTYPE_AUTOMATIC = 6,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_hidden_ssid - Hidden SSID usage.\n @NRF_WIFI_HIDDEN_SSID_NOT_IN_USE: Do not hide SSID (i.e., broadcast it in\n\tBeacon frames).\n @NRF_WIFI_HIDDEN_SSID_ZERO_LEN: Hide SSID by using zero-length SSID element\n\tin Beacon frames.\n @NRF_WIFI_HIDDEN_SSID_ZERO_CONTENTS: Hide SSID by using correct length of SSID\n\telement in Beacon frames but zero out each byte in the SSID.\n\n Enable/Disable Hidden SSID feature and also lists the different mechanisms of\n hiding the SSIDs."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_hidden_ssid {
    NRF_WIFI_HIDDEN_SSID_NOT_IN_USE = 0,
    NRF_WIFI_HIDDEN_SSID_ZERO_LEN = 1,
    NRF_WIFI_HIDDEN_SSID_ZERO_CONTENTS = 2,
}
impl nrf_wifi_smps_mode {
    pub const NRF_WIFI_SMPS_MAX: nrf_wifi_smps_mode = nrf_wifi_smps_mode::NRF_WIFI_SMPS_DYNAMIC;
}
#[repr(u32)]
#[doc = " enum nrf_wifi_smps_mode - SMPS mode.\n @NRF_WIFI_SMPS_OFF: SMPS off (use all antennas).\n @NRF_WIFI_SMPS_STATIC: Static SMPS (use a single antenna).\n @NRF_WIFI_SMPS_DYNAMIC: Dynamic smps (start with a single antenna and\n\tturn on other antennas after CTS/RTS).\n\n Requested SMPS mode (for AP mode)."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_smps_mode {
    NRF_WIFI_SMPS_OFF = 0,
    NRF_WIFI_SMPS_STATIC = 1,
    NRF_WIFI_SMPS_DYNAMIC = 2,
    __NRF_WIFI_SMPS_AFTER_LAST = 3,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_bss_status - BSS status.\n @NRF_WIFI_BSS_STATUS_AUTHENTICATED: Authenticated with this BSS.\n\tNote that this is no longer used since cfg80211 no longer\n\tkeeps track of whether or not authentication was done with\n\ta given BSS.\n @NRF_WIFI_BSS_STATUS_ASSOCIATED: Associated with this BSS.\n @NRF_WIFI_BSS_STATUS_IBSS_JOINED: Joined to this IBSS.\n\n The BSS status is a BSS attribute in scan dumps, which\n indicates the status the interface has with respect to this BSS."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_bss_status {
    NRF_WIFI_BSS_STATUS_AUTHENTICATED = 0,
    NRF_WIFI_BSS_STATUS_ASSOCIATED = 1,
    NRF_WIFI_BSS_STATUS_IBSS_JOINED = 2,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_channel_type - Channel type.\n @NRF_WIFI_CHAN_NO_HT: 20 MHz, non-HT channel.\n @NRF_WIFI_CHAN_HT20: 20 MHz HT channel.\n @NRF_WIFI_CHAN_HT40MINUS: HT40 channel, secondary channel\n      below the control channel.\n @NRF_WIFI_CHAN_HT40PLUS: HT40 channel, secondary channel\n      above the control channel.\n\n Lists the different categories of channels."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_channel_type {
    NRF_WIFI_CHAN_NO_HT = 0,
    NRF_WIFI_CHAN_HT20 = 1,
    NRF_WIFI_CHAN_HT40MINUS = 2,
    NRF_WIFI_CHAN_HT40PLUS = 3,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_chan_width - Channel width definitions.\n\n\n @NRF_WIFI_CHAN_WIDTH_20_NOHT: 20 MHz, non-HT channel.\n @NRF_WIFI_CHAN_WIDTH_20: 20 MHz HT channel.\n @NRF_WIFI_CHAN_WIDTH_40: 40 MHz channel, the %NRF_WIFI_ATTR_CENTER_FREQ1\n\tattribute must be provided as well.\n @NRF_WIFI_CHAN_WIDTH_80: 80 MHz channel, the %NRF_WIFI_ATTR_CENTER_FREQ1\n\tattribute must be provided as well.\n @NRF_WIFI_CHAN_WIDTH_80P80: 80+80 MHz channel, the %NRF_WIFI_ATTR_CENTER_FREQ1\n\tand %NRF_WIFI_ATTR_CENTER_FREQ2 attributes must be provided as well.\n @NRF_WIFI_CHAN_WIDTH_160: 160 MHz channel, the %NRF_WIFI_ATTR_CENTER_FREQ1\n\tattribute must be provided as well.\n @NRF_WIFI_CHAN_WIDTH_5: 5 MHz OFDM channel.\n @NRF_WIFI_CHAN_WIDTH_10: 10 MHz OFDM channel.\n\n Lists the different channel widths."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_chan_width {
    NRF_WIFI_CHAN_WIDTH_20_NOHT = 0,
    NRF_WIFI_CHAN_WIDTH_20 = 1,
    NRF_WIFI_CHAN_WIDTH_40 = 2,
    NRF_WIFI_CHAN_WIDTH_80 = 3,
    NRF_WIFI_CHAN_WIDTH_80P80 = 4,
    NRF_WIFI_CHAN_WIDTH_160 = 5,
    NRF_WIFI_CHAN_WIDTH_5 = 6,
    NRF_WIFI_CHAN_WIDTH_10 = 7,
}
impl nrf_wifi_iftype {
    pub const NRF_WIFI_IFTYPE_MAX: nrf_wifi_iftype = nrf_wifi_iftype::NRF_WIFI_IFTYPE_OCB;
}
#[repr(u32)]
#[doc = " enum nrf_wifi_iftype - Interface types based on functionality.\n\n @NRF_WIFI_IFTYPE_UNSPECIFIED: Unspecified type, driver decides.\n @NRF_WIFI_IFTYPE_ADHOC: Independent BSS member.\n @NRF_WIFI_IFTYPE_STATION: Managed BSS member.\n @NRF_WIFI_IFTYPE_AP: Access point.\n @NRF_WIFI_IFTYPE_AP_VLAN: VLAN interface for access points; VLAN interfaces\n      are a bit special in that they must always be tied to a pre-existing\n      AP type interface.\n @NRF_WIFI_IFTYPE_WDS: Wireless Distribution System.\n @NRF_WIFI_IFTYPE_MONITOR: Monitor interface receiving all frames.\n @NRF_WIFI_IFTYPE_MESH_POINT: Mesh point.\n @NRF_WIFI_IFTYPE_P2P_CLIENT: P2P client.\n @NRF_WIFI_IFTYPE_P2P_GO: P2P group owner.\n @NRF_WIFI_IFTYPE_P2P_DEVICE: P2P device interface type, this is not a netdev\n\tand therefore can't be created in the normal ways, use the\n\t%NRF_WIFI_UMAC_CMD_START_P2P_DEVICE and %NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE\n\tcommands (Refer &enum nrf_wifi_umac_commands) to create and destroy one.\n @NRF_WIFI_IFTYPE_OCB: Outside Context of a BSS.\n\tThis mode corresponds to the MIB variable dot11OCBActivated=true.\n @NRF_WIFI_IFTYPE_MAX: Highest interface type number currently defined.\n @NUM_NRF_WIFI_IFTYPES: Number of defined interface types.\n\n Lists the different interface types based on how they are configured\n functionally."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_iftype {
    NRF_WIFI_IFTYPE_UNSPECIFIED = 0,
    NRF_WIFI_IFTYPE_ADHOC = 1,
    NRF_WIFI_IFTYPE_STATION = 2,
    NRF_WIFI_IFTYPE_AP = 3,
    NRF_WIFI_IFTYPE_AP_VLAN = 4,
    NRF_WIFI_IFTYPE_WDS = 5,
    NRF_WIFI_IFTYPE_MONITOR = 6,
    NRF_WIFI_IFTYPE_MESH_POINT = 7,
    NRF_WIFI_IFTYPE_P2P_CLIENT = 8,
    NRF_WIFI_IFTYPE_P2P_GO = 9,
    NRF_WIFI_IFTYPE_P2P_DEVICE = 10,
    NRF_WIFI_IFTYPE_OCB = 11,
    NUM_NRF_WIFI_IFTYPES = 12,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_ps_state - powersave state\n @NRF_WIFI_PS_DISABLED: powersave is disabled\n @NRF_WIFI_PS_ENABLED: powersave is enabled"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_ps_state {
    NRF_WIFI_PS_DISABLED = 0,
    NRF_WIFI_PS_ENABLED = 1,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_security_type - WLAN security type\n @NRF_WIFI_WEP: WEP\n @NRF_WIFI_WPA: WPA\n @NRF_WIFI_WPA2: WPA2\n @NRF_WIFI_WPA3: WPA3\n @NRF_WIFI_WAPI: WAPI"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_security_type {
    NRF_WIFI_OPEN = 0,
    NRF_WIFI_WEP = 1,
    NRF_WIFI_WPA = 2,
    NRF_WIFI_WPA2 = 3,
    NRF_WIFI_WPA3 = 4,
    NRF_WIFI_WAPI = 5,
    NRF_WIFI_EAP = 6,
    NRF_WIFI_WPA2_256 = 7,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_reg_initiator - Indicates the initiator of a reg domain request\n @NL80211_REGDOM_SET_BY_CORE: Core queried CRDA for a dynamic world\n regulatory domain.\n @NL80211_REGDOM_SET_BY_USER: User asked the wireless core to set the\n regulatory domain.\n @NL80211_REGDOM_SET_BY_DRIVER: a wireless drivers has hinted to the\n wireless core it thinks its knows the regulatory domain we should be in.\n @NL80211_REGDOM_SET_BY_COUNTRY_IE: the wireless core has received an\n 802.11 country information element with regulatory information it\n thinks we should consider. cfg80211 only processes the country\n\tcode from the IE, and relies on the regulatory domain information\n\tstructure passed by userspace (CRDA) from our wireless-regdb.\n\tIf a channel is enabled but the country code indicates it should\n\tbe disabled we disable the channel and re-enable it upon disassociation."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_reg_initiator {
    NRF_WIFI_REGDOM_SET_BY_CORE = 0,
    NRF_WIFI_REGDOM_SET_BY_USER = 1,
    NRF_WIFI_REGDOM_SET_BY_DRIVER = 2,
    NRF_WIFI_REGDOM_SET_BY_COUNTRY_IE = 3,
}
#[repr(u32)]
#[doc = " enum nrf_wifi_reg_type - specifies the type of regulatory domain\n @NL80211_REGDOM_TYPE_COUNTRY: the regulatory domain set is one that pertains\n\tto a specific country. When this is set you can count on the\n\tISO / IEC 3166 alpha2 country code being valid.\n @NL80211_REGDOM_TYPE_WORLD: the regulatory set domain is the world regulatory\n domain.\n @NL80211_REGDOM_TYPE_CUSTOM_WORLD: the regulatory domain set is a custom\n driver specific world regulatory domain. These do not apply system-wide\n and are only applicable to the individual devices which have requested\n them to be applied.\n @NL80211_REGDOM_TYPE_INTERSECTION: the regulatory domain set is the product\n\tof an intersection between two regulatory domains -- the previously\n\tset regulatory domain on the system and the last accepted regulatory\n\tdomain request to be processed."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum nrf_wifi_reg_type {
    NRF_WIFI_REGDOM_TYPE_COUNTRY = 0,
    NRF_WIFI_REGDOM_TYPE_WORLD = 1,
    NRF_WIFI_REGDOM_TYPE_CUSTOM_WORLD = 2,
    NRF_WIFI_REGDOM_TYPE_INTERSECTION = 3,
}
#[doc = " struct nrf_wifi_ssid - SSID list.\n @nrf_wifi_ssid_len: Indicates the number of values in ssid parameter.\n @nrf_wifi_ssid: SSID (binary attribute, 0..32 octets).\n\n This structure describes the parameters to describe list of SSIDs\n used by the @scan_common parameter in &struct nrf_wifi_umac_cmd_scan."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_ssid {
    pub nrf_wifi_ssid_len: ::core::ffi::c_uchar,
    pub nrf_wifi_ssid: [::core::ffi::c_uchar; 32usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_ssid() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_ssid> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_ssid>(),
        33usize,
        concat!("Size of: ", stringify!(nrf_wifi_ssid))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_ssid>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_ssid))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_ssid_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_ssid),
            "::",
            stringify!(nrf_wifi_ssid_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_ssid) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_ssid),
            "::",
            stringify!(nrf_wifi_ssid)
        )
    );
}
#[doc = " struct nrf_wifi_ie - Information element(s) data.\n @ie_len: Indicates the number of values in ie parameter.\n @ie: Information element data.\n\n This structure describes the Information element(s) data being passed."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_ie {
    pub ie_len: ::core::ffi::c_ushort,
    pub ie: [::core::ffi::c_schar; 400usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_ie() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_ie> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_ie>(),
        402usize,
        concat!("Size of: ", stringify!(nrf_wifi_ie))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_ie>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_ie))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(nrf_wifi_ie), "::", stringify!(ie_len))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(nrf_wifi_ie), "::", stringify!(ie))
    );
}
#[doc = " struct nrf_wifi_seq - Transmit key sequence number.\n @nrf_wifi_seq_len: Length of the seq parameter.\n @nrf_wifi_seq: Key sequence number data.\n\n Transmit key sequence number (IV/PN) for TKIP and CCMP keys, each six bytes\n in little endian."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_seq {
    pub nrf_wifi_seq_len: ::core::ffi::c_int,
    pub nrf_wifi_seq: [::core::ffi::c_uchar; 256usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_seq() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_seq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_seq>(),
        260usize,
        concat!("Size of: ", stringify!(nrf_wifi_seq))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_seq>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_seq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_seq_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_seq),
            "::",
            stringify!(nrf_wifi_seq_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_seq) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_seq),
            "::",
            stringify!(nrf_wifi_seq)
        )
    );
}
#[doc = " struct nrf_wifi_key - Key data.\n\n @nrf_wifi_key_len: Length of the key data.\n @nrf_wifi_key: Key data.\n\n This structure represents a security key data."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_key {
    pub nrf_wifi_key_len: ::core::ffi::c_uint,
    pub nrf_wifi_key: [::core::ffi::c_uchar; 256usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_key() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_key> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_key>(),
        260usize,
        concat!("Size of: ", stringify!(nrf_wifi_key))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_key>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_key))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_key_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_key),
            "::",
            stringify!(nrf_wifi_key_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_key) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_key),
            "::",
            stringify!(nrf_wifi_key)
        )
    );
}
#[doc = " struct nrf_wifi_umac_sae - SAE element in auth frame.\n\n @sae_data_len: Length of SAE element data.\n @sae_data: SAE element data.\n\n This structure represents SAE elements in Authentication frames.\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_sae {
    pub sae_data_len: ::core::ffi::c_int,
    pub sae_data: [::core::ffi::c_uchar; 256usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_sae() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_sae> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_sae>(),
        260usize,
        concat!("Size of: ", stringify!(nrf_wifi_sae))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_sae>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_sae))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sae_data_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sae),
            "::",
            stringify!(sae_data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sae_data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_sae),
            "::",
            stringify!(sae_data)
        )
    );
}
#[doc = " struct nrf_wifi_umac_frame - Frame data.\n\n @frame_len: Length of the frame.\n @frame: Frame data.\n\n This structure describes a frame being passed."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_frame {
    pub frame_len: ::core::ffi::c_int,
    pub frame: [::core::ffi::c_schar; 400usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_frame() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_frame> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_frame>(),
        404usize,
        concat!("Size of: ", stringify!(nrf_wifi_frame))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_frame>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_frame))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frame_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_frame),
            "::",
            stringify!(frame_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(nrf_wifi_frame), "::", stringify!(frame))
    );
}
#[doc = " struct nrf_wifi_index_ids - UMAC interface index.\n\n @valid_fields: Indicate which properties below are set.\n @wdev_id: wdev id.\n @ifindex: Unused.\n @wiphy_idx: Unused.\n\n Command header expected by UMAC. Legacy header in place to handle requests\n from supplicant in RPU."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_index_ids {
    pub valid_fields: ::core::ffi::c_uint,
    pub ifaceindex: ::core::ffi::c_int,
    pub nrf_wifi_wiphy_idx: ::core::ffi::c_int,
    pub wdev_id: ::core::ffi::c_ulonglong,
}
#[test]
fn bindgen_test_layout_nrf_wifi_index_ids() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_index_ids> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_index_ids>(),
        20usize,
        concat!("Size of: ", stringify!(nrf_wifi_index_ids))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_index_ids>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_index_ids))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valid_fields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_index_ids),
            "::",
            stringify!(valid_fields)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ifaceindex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_index_ids),
            "::",
            stringify!(ifaceindex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_wiphy_idx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_index_ids),
            "::",
            stringify!(nrf_wifi_wiphy_idx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wdev_id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_index_ids),
            "::",
            stringify!(wdev_id)
        )
    );
}
#[doc = " struct nrf_wifi_supp_rates - Scan request parameters.\n\n @valid_fields: Indicate which of the following parameters are valid.\n @band: Frequency band, see enum nrf_wifi_umac_band.\n @nrf_wifi_num_rates: Number of values in rates parameter.\n @rates: Rates per to be advertised as supported in scan,\n\t nested array attribute containing an entry for each band, with the\n\t entry being a list of supported rates as defined by IEEE 802.11\n\t 7.3.2.2 but without the length restriction (at most\n\t %NRF_WIFI_MAX_SUPP_RATES).\n\n This structure specifies the parameters to be used when sending\n %NRF_WIFI_UMAC_CMD_TRIGGER_SCAN command (Refer &enum nrf_wifi_umac_commands).\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_supp_rates {
    pub valid_fields: ::core::ffi::c_uint,
    pub band: ::core::ffi::c_int,
    pub nrf_wifi_num_rates: ::core::ffi::c_int,
    pub rates: [::core::ffi::c_uchar; 60usize],
}
#[test]
fn bindgen_test_layout_nrf_wifi_supp_rates() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_supp_rates> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_supp_rates>(),
        72usize,
        concat!("Size of: ", stringify!(nrf_wifi_supp_rates))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_supp_rates>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_supp_rates))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valid_fields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_supp_rates),
            "::",
            stringify!(valid_fields)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_supp_rates),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_num_rates) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_supp_rates),
            "::",
            stringify!(nrf_wifi_num_rates)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rates) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_supp_rates),
            "::",
            stringify!(rates)
        )
    );
}
#[doc = " struct nrf_wifi_channel - channel definition\n\n This structure describes a single channel for use.\n\n @center_frequency: center frequency in MHz\n @hw_value: hardware-specific value for the channel\n @nrf_wifi_flags: channel flags from &enum nrf_wifi_channel_flags.\n @nrf_wifi_orig_flags: channel flags at registration time, used by regulatory\n code to support devices with additional restrictions\n @band: band this channel belongs to.\n @nrf_wifi_max_antenna_gain: maximum antenna gain in dBi\n @nrf_wifi_max_power: maximum transmission power (in dBm)\n @nrf_wifi_max_reg_power: maximum regulatory transmission power (in dBm)\n @nrf_wifi_beacon_found: helper to regulatory code to indicate when a beacon\n has been found on this channel. Use regulatory_hint_found_beacon()\n to enable this, this is useful only on 5 GHz band.\n @nrf_wifi_orig_mag: internal use\n @nrf_wifi_orig_mpwr: internal use"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_wifi_channel {
    pub band: ::core::ffi::c_int,
    pub center_frequency: ::core::ffi::c_uint,
    pub nrf_wifi_flags: ::core::ffi::c_uint,
    pub nrf_wifi_max_antenna_gain: ::core::ffi::c_int,
    pub nrf_wifi_max_power: ::core::ffi::c_int,
    pub nrf_wifi_max_reg_power: ::core::ffi::c_int,
    pub nrf_wifi_orig_flags: ::core::ffi::c_uint,
    pub nrf_wifi_orig_mag: ::core::ffi::c_int,
    pub nrf_wifi_orig_mpwr: ::core::ffi::c_int,
    pub hw_value: ::core::ffi::c_ushort,
    pub nrf_wifi_beacon_found: ::core::ffi::c_schar,
}
#[test]
fn bindgen_test_layout_nrf_wifi_channel() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_channel> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_channel>(),
        39usize,
        concat!("Size of: ", stringify!(nrf_wifi_channel))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_channel>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_channel))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).center_frequency) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(center_frequency)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_max_antenna_gain) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_max_antenna_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_max_power) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_max_power)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_max_reg_power) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_max_reg_power)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_orig_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_orig_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_orig_mag) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_orig_mag)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_orig_mpwr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_orig_mpwr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hw_value) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(hw_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrf_wifi_beacon_found) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_channel),
            "::",
            stringify!(nrf_wifi_beacon_found)
        )
    );
}
#[doc = " struct nrf_wifi_scan_params - Scan request parameters.\n\n @valid_fields: Indicate which of the following parameters are valid.\n @num_scan_ssids: Number of elements in scan_ssids parameter.\n @scan_ssids: Nested attribute with SSIDs, leave out for passive\n\t scanning and include a zero-length SSID (wildcard) for wildcard scan.\n @ie: Information element(s) data.\n @num_scan_channels: Num of scan channels.\n @scan_frequencies: Channel information.\n @mac_addr: MAC address (various uses).\n @mac_addr_mask: MAC address mask.\n @scan_flags: Scan request control flags (u32). Bit values\n\t(NRF_WIFI_SCAN_FLAG_LOW_PRIORITY/NRF_WIFI_SCAN_FLAG_RANDOM_ADDR...)\n @supp_rates: Supported rates.\n @no_cck: used to send probe requests at non CCK rate in 2GHz band\n @oper_ch__duration: Operating channel duration when STA is connected to AP\n @scan_duration: Max scan duration in TU\n @channels: See struct nrf_wifi_channel\n\n This structure specifies the parameters to be used when sending\n %NRF_WIFI_UMAC_CMD_TRIGGER_SCAN command (Refer &enum nrf_wifi_umac_commands)."]
#[repr(C, packed)]
pub struct nrf_wifi_scan_params {
    pub valid_fields: ::core::ffi::c_uint,
    pub num_scan_ssids: ::core::ffi::c_uchar,
    pub num_scan_channels: ::core::ffi::c_uchar,
    pub scan_flags: ::core::ffi::c_uint,
    pub scan_ssids: [nrf_wifi_ssid; 2usize],
    pub ie: nrf_wifi_ie,
    pub supp_rates: nrf_wifi_supp_rates,
    pub mac_addr: [::core::ffi::c_uchar; 6usize],
    pub mac_addr_mask: [::core::ffi::c_uchar; 6usize],
    pub no_cck: ::core::ffi::c_uchar,
    pub oper_ch_duration: ::core::ffi::c_ushort,
    pub scan_duration: [::core::ffi::c_ushort; 42usize],
    pub probe_cnt: [::core::ffi::c_uchar; 42usize],
    pub channels: __IncompleteArrayField<nrf_wifi_channel>,
}
#[test]
fn bindgen_test_layout_nrf_wifi_scan_params() {
    const UNINIT: ::core::mem::MaybeUninit<nrf_wifi_scan_params> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<nrf_wifi_scan_params>(),
        691usize,
        concat!("Size of: ", stringify!(nrf_wifi_scan_params))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_wifi_scan_params>(),
        1usize,
        concat!("Alignment of ", stringify!(nrf_wifi_scan_params))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valid_fields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_scan_params),
            "::",
            stringify!(valid_fields)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_scan_ssids) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_scan_params),
            "::",
            stringify!(num_scan_ssids)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_scan_channels) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_scan_params),
            "::",
            stringify!(num_scan_channels)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_flags) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_wifi_scan_params),
            "::",
            stringify!(scan_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scan_ssids) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
